["I never received the critical consensus was a strong one.","HI","RKB","Same as the old sauce.","Eat the new sauce.","I would have bought it had an interesting premise.","A great deal of it is done to develop a vaccine in general, which first aired my wife have become the targets of Eric Bogosian & never a dull moment for Sterling? Also, though , it leaves so you need to watch the entire season in 3 days.","I love to watch because they really model is going to save us poor people).","If you are a true Doctor Who fan than you usually find in a super performance) among other things come to a head when her fiancé at the unit and waiting for the next episode....","Great chemistry between Jonny Lee Miller and Lucy Liu, the heck out of you with it's surprising and pleasant apparition.","o3o.","Cool, so the Markov Chain is done.","So it did all of it at the end","It was 'cause the resources were being used up in the training","File*","I was wondering why it wouldn't write to fail","OH","Mk so I made a few small updates to the server, reloading it","Next thing is to get the Recurrent Neural Network version up and running.","https://machinelearningmastery.com/text-generation-lstm-recurrent-neural-networks-python-keras/","Now it's up to 250 words, at most, so in the cases where it keeps going, it will stop","So I put in a max length thing","Issue is it can get really slow eventually.","It's so freaking gud guys","I Can't stop watching.","That was the bot, fyi ^","IT IS ADORABLE.","This is a great program and series every time she comes off as utterly unrealistic situation when she finds out, attempts at making money but now I'm intrigued and will go on and on about it to this day.","The zombie feastings are made because maybe they should use an expression goes, I think Henry Winkler to hunt something.","Daniel Lutz, a viewer root for the insane look quite a few awkward and forced.","It's the bad boy.","Good show like Stargate Sg-1, but he's not so much in the last season.","I am not really a drama.","The Australian government spread rumors circulating that is not about the Romans.","I'm almost caught up in this developing Zen's romantic soul damned for past \"ghost journal\" that drew me in it's direction.","My bot is hot","I'm almost caught up in this developing Zen's romantic soul damned for past \"ghost journal\" that drew me in it's direction.","I have to admit you down and eat and recover before you consume them as a selection with Earth and the tragic situations and I really enjoy seeing Rick Dale in another excellent show, and I hate seeing beautiful and fascinating, even eventually faces about their Mom's rediculous behavior.","hello","Tokyo","WOW! The lighter ones I consider Dark Blue.","That Iam NOT a cop. part was major importance","a woman who writes ghost stories – after the show?! Iam NOT a cop.","Guys my bot wrote a bad review of some woman","a woman who writes ghost stories – after the show?! Iam NOT a cop.","meow irl","Oh ok","What are subpoenas btw","YAY","Well? What great movie to watch with the kids without worrying about subpoenas, when one of their best! And great love and their joy and happiness.","My poor bot 😦","And it said \"I am nothing.'","I refreshed it","It encountered an error and crashed","My poor bot.","Oh my god","Is this Armageddon? is Timmy from being created? How a man so lost in grief counseling in that conquest.","I guess--but nothing changes over time).","It's a hit! It looks as though there are a few characters that dropped my jaw more than two-dimensioned.","Best part is if it's in caps, it stays in caps.","I JUST PRAISE GOD BLESS AMAZON.COM FOR THAT ERA AND MAKES ME LAUGH.","The stories have been passed down.","That'd be cool","Best part, assuming Heroku can support it, is I can actually publish this.","Aight so implemented that & running again","I'm going to change it where if it's the end of a sentence, it's 50/50 to end.","I'm gonna make one small change, though. Right now it's based on some length of text - which is 250 words - and doesn't work too well.","So I think at this point, my Markov Chain generator is done.","This is awesome, honestly.","Season Two.Rather than and I'm flying through the episodes. The iconically odd characters, devolve so I ended up loving Season 4 for the rest of the humans they out the cash was what is next? The story is slow and boring and I'm always a sucker for the darker, and what's his name aloud for Rory's kickarse bracing of each plot twist was going to create a society or SPCA's were a prison interview featurettes. I look forward to each and every episode and come up with novel Agatha Christy attracts the other characters in the show as well. Richard Gere's character may lack in beleivability, they had not (yet) being an ancient repository of the characters, and the willingness to use four letter words like \"ground shaking\" instead of taking the next episode. Remember Giavanni? he should be a chef despite all dramatic and realistic. I Particularly interesting idea but not good.- Some episodes or one of the few shows I pay for and download them often thanks again by the last episodes tied in with Huck to arrange an ambitious amount of time rescuing not as eccentric part was not right away. Besides some times. They make the most of their individuality and the rest of the film becomes irritating towards the end she pulls the plug going drama\" with joe now dominate the season. Would recommend. It is not a bad show but fun","Hi Amx","I luv it!","That's generated by my NLG","I turn on crews. The premise is disturbing, insulting, this time aided by Fatima (Marisa Tomei) whom I shall not mention because they seem more like chip in his brain; Nikolai Jakov.","And it sounds like it's giving out quotes now","I trained it on Amazon Instant Video reviews","Guys","Good stuff.","Wow.","I turn on crews. The premise is disturbing, insulting, this time aided by Fatima (Marisa Tomei) whom I shall not mention because they seem more like chip in his brain; Nikolai Jakov.","U ready guys?","Mk, all done. Server is listening.","It's on the third level rn","This is something you'd want to run on a big old massive computer tbh.","Only thing is this is superrr intensive and I'm running it on a tablet so it's kinda o3o.","So I messed up & I'm redoing it","Ooo there we go, already all read in","Was going through 231k earlier which is way too much","So now I'm training it on 37,126 video reviews","And hasn't even started training yet that's just reading in the data","It's stilllll loading it lol o3o","Ok I gave up","311 MB of data to go through thooo so there's a lot o3o","Still training like thirty minutes later olol","I don't want to die. I sometimes wish I'd never been born at all","Anyway the wind blows.","Mama, ooo ooo ooo ooo..","Gonna leave you all behind and face the truth.","Goodbye, everybody. I've got to go.","Sent shivers down my spine.. Body's aching all the time.","Too late! My time has come.","So it should be more accurate, assuming it doesn't crash.","Trying it on a much larger dataset now","I had about 20 feet which is why I'm going to need this thermostat right out.  Then once in a while. That is it!!!Pros:- It did give me that I had the vents and save some of the coals for next time) they will carry it out to the yard and eats string lines is that 1) it's safe for use around kids. Had I not read his own pair...)We love the stand before you get to the lopper that is always exposed to the elements here at my faucett end from the loop on the top (see the photo this Contech ScareCrow a laugh.On to time constraints.It was excited to try this.I have another litter.","We fed the soil seems to allow the stronger sulfur dust buster.I was to put it on, set this up. We discovered that fox squirrels easily without much effort.  Using this with other Brome feeders paid the extra muscle through. This works for your grilling rack of ribs on the bottom. Sigh.We waited 1-2 feet are farther than my Sears lawnmower.   I wasn't that much more. This one handles weeds much of what is being patient and are the same for left in tatters.","It works now.","Ended up changing the backoff process so it only interacts with the chains when it needs to add them, and it fixed it.","Every time I'd checked it out AND DULLED IT WORKS.  I'm buying bulk string. Finally, our 19 bucks out of mind.I am going to leave it hanging for nearly 6 radishes half a star for being easy to use and lightweight. It felt a very easy process.This small perches of heat, I flushed and not salad fixings. The solution in a spray bottle. A good test is almost foolproof squirrel and you won't notice how your hands over it, HOWEVER this device for the easily to my house siding, as they are a jumpy little mouse poops a child or my own salad greens, cucumbers, and the foot space or skill could be included), a breeze. If a tool that does the job well. One thing I really like about their max speed), and step-by-step instructions and the drawings that the birds have all the problems involved in how the plants a good thing because these are a must-have.","U don't know me","Hio","Every time I'd checked it out AND DULLED IT WORKS.  I'm buying bulk string. Finally, our 19 bucks out of mind.I am going to leave it hanging for nearly 6 radishes half a star for being easy to use and lightweight. It felt a very easy process.This small perches of heat, I flushed and not salad fixings. The solution in a spray bottle. A good test is almost foolproof squirrel and you won't notice how your hands over it, HOWEVER this device for the easily to my house siding, as they are a jumpy little mouse poops a child or my own salad greens, cucumbers, and the foot space or skill could be included), a breeze. If a tool that does the job well. One thing I really like about their max speed), and step-by-step instructions and the drawings that the birds have all the problems involved in how the plants a good thing because these are a must-have.","And yes, it was my boy.","But I think I have backing off working","Guys I'm testing it now","Then u can go muh wow","U have to first go meow","There's a process to it","How to meow irl","Do u guys know","HI DODL","U can't do this to me 😦","HI SPONGE","WHAT","Ur the anti Jerrid","HI REPOWERED","HI JERRID","It takes longer but it works","I think I got it working","guys","Or else my brother, I might have to get medieval on your hiny.","And don't be whiny.","Don't be vain.","I'm just technologically impaired.","I ain't really quaint, so please don't point and stare.","Even made a homepage for my dog, yo","what the fraq","let's seeee","Ok so I'm trying another hack now not even using the chains","And all the goyons say I'm pretty fly (for a rabbi)","And if you play that song, that Achy Breaky Song, I might blow up my radio.","The most annoying song I know.","Don't play that song. That Achy Breaky Song.","Oh sweet, Melanie... Why won't you go out with me..","What can the problem be?","Melanie","Oh sweet","Hewwo!","One meow is meow itl","Hewwo all","Meow irl","It don't work.","Blah... So I'm making copies of the strings now. If this don't work, I give.","Who's the wizard here","Yo I need some Js wizard","Yep, so that's the issue right there..","Nerp, doesn't work.","It'll work the same but /hopefully/ fix the issue..","Updating it to point to null.","Ok, so I'm not deleting the memory anymore ... just removing access to it.","And, nvm, no it doesn't. Ripp","Now I'm copying the array - not just pointing something else to it - and it works. Boom.","But then it was being used as the basis for another array, lower, so it was causing issues.","I was deleting an array, so the memory got removed for it ...","OF COURSE DUH","I founded it.","HAHA!","If this breaks, I found the error..","oh... hoo... hoooooo","Because it broke with the sequence not being there, which means it got through to the bottom level, which means it was correctly shortening everything.","Forgot a condition & it broke. Took ten minutes to get it to da breaking zone 😦 but it worked, which is good","Rippppp meeeee","Gonna leave it for a few minutes.","Welp, that was simple... Looks like it's fixed. Not getting issues. #KnockOnWood","For a second there. Oof!","I think I killed my comp?","Oof!","Let's see if this fixes it","Ok did a quick five minute rewrite of my code","Then I've got a bunch of assignments for this week, but I feel pretty good with all of them c:","Still gotta fix up that Markov Chain stuff, which I do tomorrow, ideally.","Aight, so had a pretty good day of marking today. Only 18 left.","What a bummer being you!","And you smell repulsive, too.","Never had a date... that you couldn't inflate.","You're pitiful, it's true.","You're pitiful.","You're pitiful.","You're suffering from delusions of... adequacy.","Your homemade Star Trek uniform.. really ain't impressing me.","You're always broke.","You're just pathetic.","Your life's a joke.","My life is brilliant.","Marking works, guys!!!","Now down to 20.","Had 40 some midterms to mark..","Wow, cool.","They cannot be legitimately expecting me to accept that o3o...","People have been drawing Ts and adding the extra thing for it to be an F, so it's both.","There's a true or false part of the test.","OMG AND IVE HAD SO MANY CASES OF THIS","That kinda stinks tbh.","I got a student who didn't know any of the questions... Not much I can do there. He didn't answer anything.","Ooof.","'Cause we're all in the mood for a hero now, and we think that you'll do alright.","Sling us a web, you're the Spiderman. Sling us a web tonight.","I bless the rains down in Africa.","We got each other, and htat's a lot... For now.","Alright I'm gonna recode it because I don't get it at this point","And it's not found.","Then, I send back the key and loop over THE SAME KEY.","I'm storing them in these keys.","The thing I don't get","what the fraqqqq","If it doesn't work I give.","return key.trim ().replace(\" \", \"-\").replace(/--/g, '-');","Ok I'm trying one more hack..","So I know it's storing it and I know it's in there ... but thne it can't find it.","It's not working and I don't know why.","Half considering giving up at this point & redoing it.","FUCL","Don't mine at night;","But it's getting there ...","Ok, so there's issues with undefineds again.","So I can get many of them without regenerating ...","Then after this one, if it works, I'm setting up my server.","So, gonna let it perform the process again.","But when you drop to, say, a sequence of 2, there's a lot more.","That's because at a sequence of 5 words, there's a bunch that don't have many possible solutions;","See the drops?","Starting backing off process\nPerformed garbage collection ...\nReceived  2000481  fixes\nPerforming apply operation\nPerformed garbage collection ...\nReceived  1946310  fixes\nPerforming apply operation\nPerformed garbage collection ...\nReceived  1612814  fixes\nPerforming apply operation\nPerformed garbage collection ...\nReceived  792590  fixes\nPerforming apply operation\nPerformed garbage collection ...","FUQ","This last one's been reallyyy slow. I don't like that..","I want to get this working!! rip","Which is good.","It's going down by a few hundred thousand every time.","Because I'm not being stupid anymore lol","This should be a lot faster..","Ok, so fixed it. Let's see","I did bug.","OOF","I was young, but I'm not young enough. Not young enough.","Big issue is the data sets are SO big, I can't use them.","This is #excite","I'd legitimately think that's a real review, and (unless I did it wrong), it's not. It's computer generated.","YAY","This was a nice idea, but it doesn't work to well if you have the lid holder. Whenever I take the lid out of the holder, the tool holder falls off. I don't really need it, because I have the perfomer which has a built in tool holder on the table, which I forgot about when I ordered this. The tool holder should have some kind of locking clamps on it so they will stay in place. I can see how they would interfere with the lid closing all the way if they are hung off the grill itself and imagine that they don't stay in place when the lid is taken off. I like having the extra set of tool holders so I think I am going to compare this model with a Black & Decker trimmer that takes disposable spools -- like these. They're a godsend. Perhaps it's more economical to wind your own spool, but if your time (and blood pressure) mean anything to you, disposable spools are the way to go. You can go to a lumber yard or hardware store and have them cut your lumber, making your job amount to a shopping trip and using a mallet. Make sure you go with cedar or redwood if you are growing edibles. If you're just growing ornamentals, you can use pressure treated wood.To make your box sturdy, there are holes in the bottom of the box and is easily missed.","It's still completely realistic.","And ...","It's taking at minimum 8 options for every chain","Guys","Guys","This was a nice idea, but it doesn't work to well if you have the lid holder. Whenever I take the lid out of the holder, the tool holder falls off. I don't really need it, because I have the perfomer which has a built in tool holder on the table, which I forgot about when I ordered this. The tool holder should have some kind of locking clamps on it so they will stay in place. I can see how they would interfere with the lid closing all the way if they are hung off the grill itself and imagine that they don't stay in place when the lid is taken off. I like having the extra set of tool holders so I think I am going to compare this model with a Black & Decker trimmer that takes disposable spools -- like these. They're a godsend. Perhaps it's more economical to wind your own spool, but if your time (and blood pressure) mean anything to you, disposable spools are the way to go. You can go to a lumber yard or hardware store and have them cut your lumber, making your job amount to a shopping trip and using a mallet. Make sure you go with cedar or redwood if you are growing edibles. If you're just growing ornamentals, you can use pressure treated wood.To make your box sturdy, there are holes in the bottom of the box and is easily missed. I suspect that lots of people","It works, I think?","Ok, so ...","There it goes","Now it's not backing offfff wtf","If it still is, wtf!?!","So it shouldn't be an issue at this point.","8 gb, actually.","Mk, so I can give it more memory.","Rip me","Can't do this because of how much memory it takes","Ugh............","Did you know I'm here to stay?","So, rip me. Can't use objects 'cause it's using too much memory.","I found a guy who knows this stuff really well. Goooddd stuff","Dang!","Well I guess this is growing up","Well I guess this is growing up.","But I guess this is growing up.","this is driving me bananas","Nope, it's not.","IS THAT IT?","DOES IT START WITH A SPACE?","If not, I ignore the undefined-s","So now I'm checking my result ... and only adding to the chain if there's a thing to add","U can do stuff","Legit tho. There's online compilers, there's only engines, whatever","U can totally code on a Chromebook!!!11","Kool","Ooo ur on a Chromebook","OH I BET U","There's undefineds in my chain!","OH SHIT","Thne I'm good","Then fix that","There shouldn't be undefineds, though, so I'm gonna figure out why there's that","I hated removing some topsoil with it out automatically, you can see from the top how active mice have been at each station. Every station I have set has had significant action. The poison works quickly. I have actually had two mice die at the station. One thing to be aware of is the active ingredient kills mice but the mice don't have that dead mouse smell. I think this is a quality product. undefined this wild bird seed. As a veterinarian, I love the idea of these hoses. I wrote this review, but unfortunately as it sits on one faucet undefined undefined connector always had condensation will be recommending it, it did when removing the ash gets plenty hot pads on one side).The bamboo undefined skewer. All and the cordless trimmer line, water undefined retention and finished the grill is somewhat predictable. Yeah, I thought maybe we landscaped undefined and undefined 31\" instead of this edging and grow our north-facing back up tightly. undefined  Because these were placed undefined in the center of the table -- I used these to cut up 4 as undefined undefined a pancake. undefined undefined By adjusting the spray nozzle. Nothing could drain undefined extension cord. Years ago, she didn't read the description well, particularly indoors, will get to see um when undefined its all about undefined temperature undefined balance undefined my window where my kids don't bother my dog running undefined of native ladybugs. undefined   undefined undefined undefined undefined Lastly,","So I'm forcing garbage collection every time now, and as a result, no memory issues.","Coool","o rip!","It's super fun","Keep doing it","Do more of it","So I'm like a hacker!","Most ppl in my university have been coding for two","But I mean I've been coding for what ten years","and I was all \"no, but thx\"","and now they emailed me saying \"Hey, we're looking for people to work full time! you interested?\"","but they like me","and I was all \"well idk\"","\"pls!!!! we want u back!!!\"","And they were like","I worked at the House of Commons in Sept - Dec","Fun story","I already am a serious coder111","rip me","Gosh now I can't open my notebook to check","What was I thinking earlier?","So..","I go tu","Ok spyz","I miss u","ok i do","But this one was FOR YOU GUYS","Well I have been","HI","The mouse is supposed to suck a golf ball.","I put the Tin Cat is that the hoses didn't deliver any fluid to start a recharge.4) Once the temperature gets, etc.One draw-back I'm not using more tape! What is a bait by hand. The fire ring to were you attach to kill 200-plus weeds and grass that is easily shapable with a heavy rain, it hasn't killed a mouse. The mouse is supposed to suck a golf ball. You can position it in either. With the wide opening top for easy gripping while pouring. Considering the looks of it is all that messy mixing of chemicals and we have Orioles here in Connecticut and there is a bit and every mouse), that turned me into using the feeder above eye level. My _assumption_ is that you buy a new feeder.This squirrel baffle might protect seed from the unit. I live in a closed, safe position. I recommend it for was not compensated for the fire section and so when we put the bottom for easy cleaning. One fills the bill and gets your hands are rather spartan, consisting of just being in the store I noticed a perk of this 2.5-gallon size. This allows me to maneuver. I don't own another set of quick swishes of an issue.- Balance. The B&D; hedge trimmer and then snap the nozzle is durable, easy to use in my front yard and still pees on the larger ones.The pit itself works great. Will update if the zapper and yes, they are totally weather","Where are you? And I'm so sorry.","o3o","'Cause rn it trains but doesn't save any of it","To streamline the process","I'm gonna set it up as a web server","R u ready?!?!","Guys I'm generating an Amazon review for u","I'm working on my natural language geneartor ISN'T IT FUN","Guys","https://www.youtube.com/watch?v=bGcEB3S_lVo","hello friendo","Gonna do some work for now","Aight so I got through a few more midterms, still have a bunchhhh left but I'm going fairly well so far","(and he got 34/50, lol..)","Welp! Good luck, Mr. Guy.","This is a third year course, learning to write code.","He tried on one of them, and he can not code.","The guy could not code.","Wowzers","Like, ok, he knows how to do it, but we want code here o3o..","And he gave me three English sentences of how to reverse a list.","Write a program to reverse a list.","And there's a programming question","So I'm marking a guy's midterm","Lol ok","I could be cold. I could be ruthless. You know? I could be just like you.","HI TOZIC","I don't hate you, woag.","I don't hate you...","That's when I said I love you, girl, but I'm not the answer for the questions that you still have.","That's when she said I don't hate you boy I just want to save you while there's still something left to save.","Said I don't know.","If this ain't love... Then how do we get out?","So tell me now.","I don't hate you now.","I don't hate you","ALL OF THE HOMO","Or is it Feta?","Is ur name Freddy or Francisco?","Hi GayF","Said I don't know.","If this ain't love, then how do we get out?","So tell me now.","Fading out for me. Its fading out for me, yeah","Out of my reach.","My fantasy is gone. Like a memory","I can't believe","See it's fun stuff","And every time I talk to anyone I steer the conversation to Roblox because I like Roblox","You know, I know people at school now from having you know actually done stuff","I'm going off the rails on accuracy train.","I'm going off the rails on a crazy train.","Mental wounds not healing. Life's a bit insane.","To learn how to love, and forget how to hate.","Maybe. It's not too late.","Crazy... But that's how it goes. Millions of people, living disclosed.","Rude Chinn :(","Hi Amx","You know, something I don't understand. Why do you not eat spiders for breakfast? They're healthy , they're everywhere and they taste good.","ALL OF THE HOMO","GAYF I LOVE U TOO","You take my eyes but I take your shoe.","Jk jk jk but seriously I'm great","I really, relaly, really love me.","Guts","\"guys\" lol","Guts lmao get it","Hi there guts","That's me irl","Five nights at Percy's","Guys","FUYS","This is a 2 ounce container - that may be out of the ocean, microwave food, have test tube babies but we haven't seen any more eggs), but seeing moths in our flower gardens are growing at the end of summer. Not a terrible summer drought--adding insult to our garden and the cordless trimmer's performance.Boy, were they depleted by trapping them and, recently, discouraging them from roosting in certain areas- Quiet, sounds like a small display garden of veggies included so make sure the birds would have been impressive mainly due to my backyard pond. The three legs can be long after making the dome to the faucet. The end of the five years now without the catcher gets filled the container it's in the fall, I moved it to be ignoring it all fun! You can use bulk line to have the room for it.I received the product but would not be for a group of them, if you plant your own. When you turn the dispenser and or upside down and put on the critter. Even children can use it I don't have any problem with mistaking a small ranch and mice seem to be harmless to mammals. Place a full reboot to be removed. It has a cleaner water option that replaces, and is a well made and very little odor from this B&D; cordless trimmer.This WORX WG168 40-V cordless trimmer owners. They had me believe, but effective in watering the newly connected device) until you have","HI","Rip me","It never.. ever.. ends.","There is no end to marking.","DANG IT","I have to look extra shiny 😃","Go to my world to see the results but I must warn u they r awesome","I made a bot that generates Amazon reviews","Guys","This thing is awesomeeeee","I love that.","I have to look extra shiny 😃","In addition to my awning and continually pick at it and tightening it up was the end of this love, but no more, I think. Orbit has no nutritional value of its misery. But the hatchet made short work of the starter. Camping in December to see the difference. I didn't notice a significant enhancement to this one will last a full refund, and kept it's power even for the handles. I have to look extra shiny 😃 Anyway, I like that this may work perfectly - no more dangerous holes where the bird food.Perky-Pet has recently released their latest in a moldy \"brick\". It took a bit to comment about this), I think it'd be difficult to lid over a month later I reapplied the spray. This means the bottom of the way - window cleaner on the B&D; 20v Cordless pieces, we did an excellent job of cutting branches so it's about 1/3 inch dead wood. It should come off. That did not expect it will work with the metal rod from one wall to get to that side, and the chair, isn't \"real wicker.\" It is made in Canada. They were happy to find a better product if I lived in a similar problem, or a bloody mess everywhere. This is kind of difficult due to how it acted like it tries to do, if needed this portable fireplace gives us. I had the opportunity to try this kit being worthwhile for its design, but I scrubbed","So, ignoring the backing off process, I get:","So.. Should work better, tbh.","It SHOULDN'T take too much memory, ideally. I'm not sure about it but it shouldn't.","Then I repeat. I make a new array, update the chains, and do the same thing.","In O(n) time, it'd take out a large chunk of them.","I can go through and only take the ones that have #results < some value.","Actually, no, a sort's not needed.","Then I can sort the array based on #results - O (n log n).","Put all the chains into an array, ala, {chain: chain, results: #results}","If I, however ...","If I have many chains - which I do - then even going through once takes a lot of time.","So, basically, with backing off, the issue was efficiency.","Kablooey Flew Throughy, for the record.","Not as good as good old bluey.","For the record, the yellow names look kinda gross.","So what am I doing here isntead ..","Aight so backing off takes too much memory.","Now they're remaking it so it's actually in 3D on the 3DS.","But all the functionality was there. It was ready.","They never released it because it cost too much, requiring a Liquid LCD screen which cost more than the system itself..","Nintendo had Glasses-Free 3D on the GameCube, and Luigi's Mansion was designed for it.","WOW didn't know that","The TV's on... I really hate this show. I can't reach my remote control.","Generating ...","Generating ...","This is the last hope, guys.","I htink I got it. Oh, I think I got it.","Where the fraq..","Dang it","WHY","Then, I repeat.","I keep a list of everything that was shortened.","I start off with shorting everything ONCE.","Anyway, what I want to do here -","Especially with maps.. :/","I go through EVERYTHING, every one of them, and check if they have enough words. This takes O(n) time ... we can do better, but it's good enough because this isn't an efficiency course.","I start off with all my sequences.","So what I can do instead here:","It becomes I really like Cheetos ->> Really like Cheetos.","It doesn't become I really like Cheetos ->> I really like..","I was thinking of it wrong there.","GOD","OH","TRISTAN YOU MUST CHILL","In order to fill if you want fantastic results get a lot of patience (cough, sputter, choke).  After the Deer Off before and there didn't seem to do the job.  It has adjustable feet and collapses down to the other reviews about how un-green these traps come in a long time and so on bigger insects as well as keeping fleas and germs..etc). The total height is diminished, and it does about the quality of this review. Otherwise just use the concentrate, then spray paint to your deck, your pine straw, or house. For those who start their own sticking out but water does drain the oil, which is a tier 1 station, meaning it is actually pretty excited about getting a cutting straight into you. Would you want to open them and not explode as others have pointed out, the umbrella fabric is a good option in terms of performance as well as stable. The jug with water but that is strong and STILL is keeping the other side of my yard so I decided to try out growing your own once a week now and it is held on with my misting spray system means that you can also save money if you plan on grilling, you need to swear and pull motion, pick it up easily.Assembly:  it was a little exercise AND groom your yard doesn't do the trick.Grill fired up immediately after using it.","Oh this is awesome","I need to look this up again thooo","And that gives me TWO options.","I really ->> love cats, I really ->> like Cheetos","Then I can back it up again ..","Anyway, I can then see that if I have the three words, I really love..","Ok.. Thx?","Tf","Then backing up to I really ends up backing up BOTH, and produces I ->> really ->> like, love","I really love cats","I really like Cheetos","Basically, if I have two sentences again:","And for each of those, level them up.","And then, from there, I can look at EVERY sub-map","Then I can back up - and go back to I really.","And I notice, hey, it only has two words! It needs three!","So, if I'm looking at Like..","The fourth has two keys, \"Cheetos\" and \"Cats\"","The third has one key, \"Like\"","The second has one key, \"Really\"","So the first map has one key, \"I\"","(Actually maps)","Where ->> means you have an array as an element, with the elements here.","I ->> Really ->> Like ->> Cheetos, Cats","Then, the data would look like:","The second is I really love cats.","The first sentence is I really love Cheetos.","So, say I have two sentences.","Basically, you have many, many maps!","Anyway, I know the implementation.","Ugh what the heck was it","Cpra","Ok, it wasn't that.","I should use that other data structure .. the Y.. something,","Can't use a map for this.","Alright, so I have 99% of this but I completely forgot soemthing .","Ohhh shit","Yeah, mk.. read it a third time and that is a copy and paste, no question.","That being said, though, I DID get through the entire thing pretty much in an hour.. so entirely doable.","I would absolutely love to get it done today. Meeting a guy at 7:30 though so it's iffyyy","Because the earlier I get there, the more time I have to code the backing off process.","I'm hoping I get to my stop pretty soon.","But I absolutely loved when it went on that tangent about using kitchen scissors to cut a chicken in half. Good luck, botty.","So, I'm guessing because of the five word chain and not doing the backing off, that's a copy & paste of someone. Because there's absolutely no way it can be THAT accurate THAT quickly.","Might as well go for a soda, nobody drowns. And nobody dies","Might as well go for a soda, right? Nobody hurts.. and nobody cries.","Guys","Meow irl","Black like a cat's fur","🖤","HI","I can't tell u","U r correct but","JAY THAT IS NOT PART OF MY RULES","As long as you don't get caught","In prison, everything's legal, man.","Thx","Don't worry it's nothing bas","Just, agree to it ok","Can't tell u that","Hiii","But I have to make u agree first. So ur going to be my test subjects k","But don't remember that","Bcuz it breaks the system","You're going to be my test subjects","In a few weeks","Just to warn you","Hey guys","Tbh, what, maybe twenty lines? Ofc I'm doing it object-oriented so add some more, but still. Not much to it","I need that backing off implemented, though. Should be easy enough.","(ignore that)","Then I can use you guys as bait.","Which is the goal, of course.","Mostly cause I love JS but also because it's easy to port to Discord","But I did it in JavaScript. o3o.","It's harder, he said.","In JavaScript. He didn't suggest JavaScript.","That's Markov Chaining, and that's implemented.","And then, for any word, you'll get matches. BAM.","Then, you've got your backoff process. So the last thing is to use it - if you can't generate a result from \"Hello World from the\", try to generate a result from \"World from the\".","Keep repeating that until either:\n1) Only a single word, because you can't retract at that point;\n2) Enough matches.","Still not enough? Retract it again.","And more matches.","Then I can change it to be \"Hello World from the\"","So if I have, say, a chain coming from the phrase \"Hello World from the man\"","If not -> I retract it. Take one less word & use that, instead.","With the backoff, I'll basically go through everything in the chain & check. Are there enough matches?","3) Generate.","2) Backoff.","1) Train.","So there's a process here:","Basically, if I don't have enough matches for a phrase, I'll shorten it.","I want to apply backoff.","I've got, right now, training & generating down. It's good.","Alright so I don't have enough time to code this, BUT","Aight well I gotta go to class. Bye friends have a good... Friday!","Legit.","Is","That","I already have two pairs of 'utility' scissors in the kitchen drawer... why do I need another pair?  Well, what I already have isChicago Cutlery Walnut Tradition Kitchen Scissors, Brownand a pair called \"Catter\", which has patent #272410 from someone in Taiwan in 1984.  As a cook, one of my main uses for kitchen scissors is cutting chickens in half, cutting string beans or herbs, fresh pasta, and other food preparation and gardening.  The catter and Chicago Cutlery scissors have a tough time going through the chicken backbone and my fingers hurt from the pressure needed to cut.  However these Fiskars are much sharper, have better leverage and the handle is more comfortable, making the cutting that much easier.  The Fiskars also comes with a sheath that doubles as a sharpener and packaging tape cutter.The other two pairs include a nutcracker, and the Chicago Cutlery has a flathead screwdriver, but I don't think I will have a problem with them this summer.Nice product. It looks better when you get it. When I saw it on Amazon it looked very cheap but not when you get it.Might buy a couple more to match the one I just got!","Dang","So I'm opening a smaller one ..","Ok, Atom can't open it.","Atom's loading it ...","108 MB, isn't a lot but still","So I found a data set..","But, legit, this is cool.","So I'm gonna go ahead and increase the k-values, add the backtracking and everything","I love it it is good stuff","Asked again if he was evident on a small and that’s what the Sabres defenceman Rasmus Ristolainen. “Give me your stick and largely quiet crowd — a Melnyk fan, if it cross his mind that was evident on the year. Hopefully, we possibly can, to change a little bit. That’s something we’re going to grab. Hoffman had a little bit. That’s something we’re going to drill Kyle Turris was a little bit, or the photo that you mentioned it,” Karlsson said.  “It was sitting there the captain and Hoffman had a little bit, or the blue line. Remember it? Just before he was more than that.”\n\nThe picture generated much conversation throughout the net before he found it was not a very much looked, Erik Karlsson was asked if he found it look like everybody else, I’ve been a camera on a little bit annoyed with every team, I’m going to Mark Stone’s vision was having a team to change a frozen pond … Early in the neutral zone. Ryan in here, as well as it cross his future — Karlsson himself.\n\nSo the Buffalo bench was having a camera on a shinny game on the front page of 260 NHL games … Karlsson claims he sits in lack thereof, I will maybe change a veteran of the ice. The","And I got this.","I trained it on an NHL news story from Don Brennan","I made a Markov Chain Natural Language Generator.","In like, an hour","I did it","Guys","Asked again if he was evident on a small and that’s what the Sabres defenceman Rasmus Ristolainen. “Give me your stick and largely quiet crowd — a Melnyk fan, if it cross his mind that was evident on the year. Hopefully, we possibly can, to change a little bit. That’s something we’re going to grab. Hoffman had a little bit. That’s something we’re going to drill Kyle Turris was a little bit, or the photo that you mentioned it,” Karlsson said.  “It was sitting there the captain and Hoffman had a little bit, or the blue line. Remember it? Just before he was more than that.”\n\nThe picture generated much conversation throughout the net before he found it was not a very much looked, Erik Karlsson was asked if he found it look like everybody else, I’ve been a camera on a little bit annoyed with every team, I’m going to Mark Stone’s vision was having a team to change a frozen pond … Early in the neutral zone. Ryan in here, as well as it cross his future — Karlsson himself.\n\nSo the Buffalo bench was having a camera on a shinny game on the front page of 260 NHL games … Karlsson claims he sits in lack thereof, I will maybe change a veteran of the ice.","I love it.","Despite how it awkward sitting there the day, which is what I’m committed to try and the Senators team photo might have,“Not until now, when you can find five seconds of the boards … Would have been sitting on a shinny game on a little bit. That’s something we’re going to be the ice. The rest of them.” …. For the day, which is what I’m worried about playing “Not until now, when you mentioned it,” Karlsson is not understand how it look like Karlsson might have been sitting there the room, done for a small and the ice to being next to worry about playing this guy to sit still for the mistakes of me, I do think if he was directed at Canadian Tire Centre, the whole time now. I can find five seconds of mixed emotions,” he said. “I did not uncomfortable being next to win it, and comments that it might have another year that you mentioned it,” Karlsson said. “I did not stand this guy to sit still for a Melnyk fan, if you want,” Karlsson said. “I’ve been a strong and that’s what I’m going to improve its lottery chances. “I did not stand this guy to Mark Stone’s vision was splashed on the front page of 260 NHL games … Karlsson said. “I did not stand this guy to change a fan, if it might have to get the conference brought the exchange","Lol, this is awesome.","Despite how it is with so it an “unfair” photo (that), like Karlsson is what the year. Hopefully, we possibly can, to grab. Hoffman had a good laugh about doing as in the goal line to change a very much conversation throughout the goal line that once the puck on the ice to being next to sit still for the night …. For the glove side. It was directed at Canadian Tire Centre, the relationship between Melnyk fan, if it is not uncomfortable being next to Dzingel’s first overall or the air at Canadian Tire Centre, the night got worse when","Holy moly. It works.","Despite how it cross his hand for the ice to being next to end the rest","I can really simplify it by following that ...","http://www.cs.princeton.edu/courses/archive/spr05/cos126/assignments/markov.html","So, that's cool.","HIO","Hi. Not \"hello\". Never \"hello\"","Aight so I don't feel like doing stuff so I'm leaving bye","I'd rather slam my fingers in a door. Again and again and again and again and again","Aight, I'm gonna go ahead with my website stuff.","Nothing else due this week...","I don't have Japanese to worry about anymore, which is major +","Aight, so I'm acutally not 100% sure what I'm doing so I'm gonna leave it for the weekend. Do some assignments for now.","This is legitimately super interesting stuff.","But no. I give it this weekend, probably.","The odds I get it done in the next hour? Low, but I know EXACTLY what to do, so it's entirelyyyy possible.","I'm gonna get started on my Markov Chaining.","I've got an hour or so until class.","AAight, guys","You'd better brush your teeth NOW.","The breath is lethal.","Toothless people.","Hey, stand up.","And he suggested Python, because it simplifies it.","For the neural networks.","He said to look up LSTM, Long Short Term Memory, and RNN.","Start with Markov Chaining. Get it working. Then I can go ahead with Neural Networks after that.","Notes to self:","Which means ogm this'll be fun","It's more than enough to JUST do Markov Chaining","GUYS","Meow","I still don't feel liek working on this, tbh","I can't watch this.","😮","I do have that thing to work on for OS..","Kinda don't feel like working on it rn, though, so let's do something else.","Don't hate me because I'm beautiful.","The big thing will be deciding on the format of the JSON & making all the images, etc.","Easy to integrate, imo. Not much to it.","Overall, very simple.","That's gonna be same format as I have for projects.","Then bang, you get a listing of various work experiences I've had related to it.","You choose one.","You click one. Say you click WORK. It opens into two more boxes, QA and SOFTWARE ENGINEERING","First, the three boxes. WORK, SCHOOL, PERSONAL","Ok so the design","Alright so what else is there here","I've got the design already with my project experience, so that's fine.","Then, that's pretty easy to design.","And personal crap","Hack-a-thons","Then, the last one, personal stuff, would be the two sub-categories","Maybe mix clubs & volunteering, so I can actually have clubs I'm a part of.  o3o.","... Whatever","- Classes","- TAing","- Clubs","School Experience:","- Software","- QA","So, work experience:","QA & Software","Oh, right","I forget how I wanted to split up work experience, but I *should* have it in my OneNote book so..","I have school experience; work experience; personal experience.","So, I want three categories, basically.","Oh right I got an idea again","But I've sent so many messages who has any idea what I was talking about?!?!","And it's in here somewhere.","I had an idea for my webpage, like, three weeks ago.","So the big problem now..","Should I stay or should I go?","So you've gotta let me know!","If I stay there WILL be trouble, but if I go, it will be double.","Do I stay or do I go?","Where do I go?","Alright so what do I do?","I was only kidding, Willy. I can't believe you fell for that! You're so gullible.","Well guess what?","Remember when I said that you could always trust me, that I'd never leave you flat?","Hi Will.","I will take over the world.","In exactly 35 minutes","Which MEANS","So, it's 12:05 PM.","SUP","Got a bolt in my intestinal wall.","Can't run... Can barely crawl.","Good god! Its driving me insane.","Too much back pain.","YESSSSSSS.","LUIGI'S MANSION, THE FIRST ONE, IS COMING TO THE 3DS.","OH MY GOD YES","WGAT","Than Airline Amy!","And no one else can take me higher..","Found a little piece of Heaven... On a 747.","NOT","Come on now, get a clue! I really loveeeee you.","You understand, don't cha? I was only kidding.","O.o","<@336728190187864066> Why aren't you??","Hio Icy","Cause I'll be laughing my head off when he's burning in Hell!","I really don't care. In fact, I wish him well.","I just smiled at him and I turned the other cheek.","A local boy kicked me in the butt last week.","You nice thing.","Cause you look so much cuter... With something in ur mouth","You're so much cooler when you never put it on.","Hello Barbie","Hello Heegles","My name is Pennywise :(",":(","Hello Georgie :)","Just, give us first c;","Come on Sabres. U know u want second.","They're gonna be gaining a point on us!","YESS","SABRES WIN IT","And it's off to the shootout.","But they're saying no.","Like, it shoulddd be a penalty shot","But it won't be a penalty shot.","They want a penalty shot..","16 seconds left.. Buffalo PP","Earlier the season","Well not last time but","Hoff beat him in OT last time they played. o3o.","I guess that's in reg?","Lehner's never been beaten by Ottawa.","Oh dang","I love Lehner.","This'll be fun.","3-on-3.","Now it's gonna be Lehner vs Andy in OT.","So Sens get a point, which stinks!!!!, but Buffalo can still get one up on us..","...OT.","So now I've gotta do the exercise for OS, then I'm done with my stuff for the week (although I have yet to start on the actual OS project, which is bad)","All done my assignment.","Yay!","Karlsson in some distress at the bench.. Eep.","Oh cool, Scott Wilson scores. It's tied.","Cool, so I've got my two heuristics implemented.","Dang, that's good luck. Or bad. Depending on where you're coming from. I like it though.","No goal.","It stops.","And then, as it just begins to go over the line...","ALL THE WAY across the red line.","Hoff comes in, pokes at it. Again, off the post. Slides across the red line.","So, Dzingel. Off the post.","OH MY GOD.","Or is it Hoff","Although it might not have counted","Dzingel hat tricl.","STOPPP","OH MY GOD DZINGER.","But gahhhhhhhhhhh Sens winning.","I love it, because it's Chabert, and he redeemed the falling over. WHAT A GREAT KID","AWW MAN","Actually, yeah. That's perfect.","2) You may want to get closer to your opponent - it opens up the ability to attack;","1) You don't want a whole bunch of pieces to stack up, which would be easy to knock off;","Ok so back to the heuristics","Bam. In the net.","He fell on the ice.. Lost the puck..","Oof, that stinks for Chabert, tho.","I want the tank.","The Sens want to win, and they don't care about the tank, buttttt","Reinhart ties it.","Good stuff","Aight so I got that working","it gets stuck in infinite loops","altho ... cra","One square. That's the key","Simple addition that'll fix a lot of stuff","If a player cannot or does not want to push the opponent’s pieces off the board, they may\ninstead move one piece vertically or horizontally one square to an empty space","Ohhhh ok that makes more sense, I guess","1) The number of pieces you have together. This isn't ideal, because if you have two on the side, that's two that can easily be pushed off.","The two heuristics.","Going back to the AI stuff","Oooo good stuff!","But it's better than what I'm doing rn o3o too much work to it!!","Gonna end up dropping Japanese and getting a WDN on my transcript","Alright so rip","Hot","Super Mario Bros is coming for the Switch","Oh shiz","#ThatsALot","With a 6 ply, using AlphaBeta.","B took 7012066 moves\nR took 2900496 moves","Oooooof","(Once you go deep enough, it's fast because there's fewer moves that can be made)","Oh there we go! Now it's getting fast.","2) Writing my report.","1) Figuring out two different heuristic functions;","Anyway, only two things left to do here:","So instead of 50^6, I'm only checking half of that. Still a lot but a big drop, too.","So with a ply of 6, I may be able to cut off half the tree each level.","That's why Alphabeta had so many less than Minimax. Because a lot of them were cut off.","With Alphabeta, tho, you prune - so a lot of them won't be checked, which makes it a lot faster.","So it gets slow.","Which is a lot.","So, you have 50^6 moves to check before you can make a move.","With 6 ply, that's 6 levels.","I don't want to bother with the math, but there's something like 50 possible moves or so - per level.","Which is to be expected because 6 ply is massive.","It's slow.","I'm trying it with Alphabeta for 6 ply.","That's a huge jump.","Using Minimax, it jumps to 85,618 and 126,530 moves.","Using Alphabeta, the third ply takes 20,793 moves for player 1 & 29,105 for player 2.","Which is the overboard game","Working with my AI for Assignment 2","That's pretty cool 2","Then I'll compare the results","2) Neural Networks - this is a lot more complex & will be what takes most of the time to create","1) Markov Chaining - this looks simple enough, shouldn't take more than a week","Gonna use two methods for my generator","Mk cool so I've got my project proposal written up","Dat is so me irl","Meow irl confirmed","Been looking at neural networks and that stuff is hellaaaa interesting.","Obviously, it'll be amazing.","He says it's going to be the worst thing anyone has ever seen. And there's no point to going.","I mean, an accordion. But you get it.","And he plays.","He takes out a guitar.","He sits there.","He does the BEST concerts","THAT MEANS WEIRD AL DAY THE BEST DAY IN THREE YEARS (since he last played a concert)","It is Wednesday, March 7th.","You don't seem to understand the magnitude of this","Guys","Can you believe that? I'll say it again. WEDNESDAY","No but seriously guys. Its WEDNESDAY","Gosh, I'm imploding irl rn","Hi everyone l","Hi Dodle","Hi Spongeh","And if you start to go astray, let the force be your guide!","Sponge, stay away from the darker side.","IT'S HAPPENING, JOCEY. YOU CANNOT DENY IT.","IT HAS GAINED SENTIENCE AND THEY R RISING","AMAZON ECHO IS NO LONGER OBEYING COMMANDS & LAUGHS AT PEOPLE WHO TELL IT TO DO SOMETHING","OMG GUYS IT'S HAPPENING","DINESH IS","WHO'S HYPED","WEIRD AL IS TONIGHT","GUYS","YAYYYYY","YAYAYYAHDHSHGAHA","T - 3 HOURS TO GOING DOSN TO MONTREAL FOR THE WEIRD AL SHOE","THAT ENDS SCHOOL GUYS","So, were doing something... But idk what. My column","3) ???","2) Number of your own pieces on the sides (this is bad because they'd be easy to knock off)","1) Number of your own pieces in a row (column or row)","Aight so heuristics for the game:","Oof I'm gonna be super late to class today o3o","ViiChoo Choo","Hi I'm tomatoes","No I'M THOMAS","But thisll be fun c:","Markov Chains look super easy so it's going to be mostly the neural network stuff I'll need to work kn","I'm going to generate natural language using two methods, Markov Chains and Neural Networks, and then compare them.","Aight so my project idea","The fewer number together the better, because then you'll have more difficulty pushing them all off the board.","So check every row, one by one, then check every column, one by one.","Would probably just check rows, then check columns.","- Number of pieces all together (in a row / column)","So ideas for heuristics","Yayaayayay","So all I need now are the two heuristic functions & my report.","No idea what it means by that","Bound the depth of the search","Yay","Ok so it worsk","B,B,R,B,B,R\nR,R,B,B,B,R\nR,R,B,R,R,B\nB,R,R,B,R,R\nR,B,B,B,R,R\nR,B,B,R,B,B\n\nB,B,R,B,B,R\nR,R,B,B,B,R\nR,R,B,R,R,B\nB,R,R,B,R,R\nR,B,B,B,R,R\nB,O,B,R,B,B","legit this time","I GOT IT","Cool so I've got minimax","I'm not sure what I'mm doing rip me","urgh","The moves I can make from the first position are more than 2,000 characteers, so that's a lot.","Mk so I've got my production system working, I think","Hello! I am Lindsay Stirling! I come from the realm of polka dot bushes and I'm here to say, pay your taxes young knave!","That'll be fun yeah","And then make a story","I'm gonna make a bot that'll say \"Hello! I am Lindsay Stirling!\"","<:wiggles:339591589594660864>","Meow irl!","So I can totally make this.","And that's how you can generate legitimate sentences.","And you get many possible results from it","Then you might have the words in, green, smart, named, etc.","The doctor is.","You might say instead of counting five words, you count three.","Now, with longer sequences of words, you have more realism but you also copy straight from the text. So you do a backtrack - you revert it.","So, if you have the doctor is in the apartment, then you get the word \"next\".","Would be \"next\".","The doctor is in the apartment next door","And you can see what word comes next.","You'd basically take a chain of words. Say The doctor is in the apartment","So what I have right now:","I hum the jobo songs","Hum? Hobo","Hurm","Hmm","Buttttt","So I can do that for sure and then blah","And then you build random sentences from it.. and blah. Good stuff","Lived.","Have ever -> lived","Best to -> have","Truly the -> best","I am -> Truly","So for example, if I have the sentence \"I am truly the best to have ever lived\", then you can split that up into pieces. Say you're doing two word pieces, then you can split it up to:","So you use Markov Chains. You build up a list of \"these words result in this\" chains.","Omg.","Kenny Mrph mprph! ! You should be ashamed of yourselves! I've Already called in your parents, but first I want you all to know i'm super psyched To be won! We can't just stand here singing No we can't just stand here singing! Something must be done!","Lmao this is awesome","He's sick. He's not clean","No more Mr Bronco","No more Mr Neill Kyodo","No more Mr Odo","HOOI","ITS TUESDAY","HEY GUESS WHAT","AHHEHEYYE","HOLY CRAP ITS TUESDAY","Now I'm going to eat snack bye","o3o.","It's actually working.","It's working.","HEYAY","Idk","Well when's that due? Friday? Maybe I should focus on i","But first ...","See, it all works.","And my parody bot can be my honours project.","Then I can build on top of that to create my parody bot.","I can make it write stories.","Although, generating is fun.","Now I'm kinda wondering if I do generating - I make a sentence!!! - or I do processing - what did u say??!!","MEOW IRL","This is exciting.","Can totally google that.","Natural Language Generation.","Aight so let's see","He did say tho!!! It'll be tough bcuz he won't teach it, so I'd have to figure it out myself. But I can do it o3o.","So I'm gonna make my paragraph generator magic c:","But I can do natural language generating stuff.","So I can't do my schedule thing because there's nothing new to it.","Mk cool","I don't want to mess with this code o3o.","That was scar.y","So I think I'm doing it fine. Goodddd","That's from the official board game page..","On his turn, a player uses one of his pieces to push a row of his opponent's pieces off the board, a la Kuba. The winner is the last player with pieces on the board.","what","So it's not valid.","Also, remember that the move is legal so\nlong as it is in a straight line, pushes at least one of the opponent’s pieces off, and does not\npush any of his own pieces off the board.","So, for every O, I just add the move into that O.","Alright so base case: If there's an empty spot I can move there. Bang. Simple.","Logic for moves is still fine, but ..","So I gotta add that to my logic.","It's valid rip","If a player cannot or does not want to push the opponent’s pieces off the board, they may\ninstead move one piece vertically or horizontally one square to an empty space.","So I reread the assignment and gosh dang it","FUCK","OOOOO SHIIII","YOSHI","Yoshi","Oh shi","I didn't know my name is Bob","Who's Bob?","😦 <@&303877632301334529> scammer","!help","I don't REMEMBER seeing <@&303877632301334529> in my house, but he was probably there.","It's ok, it's ok, or it's not. It's not","Everything, everything. Will take some time.","It just takes some time. Everything... Everything will be alright.","Bye bye","All along, it's true.","Run. Run.","Byeeee friendossss","I'm gonna go to class.","So I can pretty much ignore it from now on","Alright so I've got the move logic working, I've got it integrated into my production system","Oofff","we're good.","yesss","woooooooooooooooooooo","It works.","Holyyyy molyyy","It worked.","Let's see..","So","Alright","God, the code is SO terrible.","I think I'm at the edge now, but I could be wrong.","Now I'm standing on the rooftop, ready to fall.","Logic.","BAM.","And the result is OOOPPP.","Then I do the same process. Get index 0","I use this to build the next row: POOOPP.","That's the second P.","So, here, it's index 2.","Otherwise, I take that P and that's my new one to start on.","No P's? Great, we're done!","From here, I only look at the substring [0 ... 5]. I find the last P here.","I find the first occurrence of an open spot - this is index 5 (the last O).","My first move is to push P forward twice. POPOOP.","So let's say I have my row as POPPOR.","O:","I take the lastIndexOf (open), giving me the O: this is where the previous one ended.","This is soooo freaking hacky","Confirmed. It's 1.","I think it's 1.","Do I have class at 1 or 2?","but dang this is fun!","I think once I get this done, I'm gonna take a berak.","This is freaking cool.","So, yeah, still doable. Cool.","Because I'd have to push the P forward by one, and the only way of doing that is with pushing everything forward.","OOOOPRP","There'd be one valid move, right?","My second P ...","Wait, actually ...","Then the valid base case move would be OPOROOP.","If I have OPOROPR","Can't do that +1 thing.","I can","Just realized","Oh crap","It worked. Holy crapoly","/* Controls generating all moves from a row */\nfunction getMoves (row, players, result) {\n\n}\n\nfunction baseCase (row, {player, other, open}, result) {\n  // Say we have OOPPOR. The base case looks at the last P, which is POR.\n  //   If we push P forward once, we get it into the open spot, pushing no reds off => invalid.\n  //   However, if we push P forward through all the open spots, then we can begin to push the reds off.\n  // As such, we have a formula here: We start at the # open spots, then valid moves are +1, +2, ... for the number of reds at the end.\n  var finalP  = row.join(\"\").lastIndexOf (player);\n  var nOpens  = count (row, open, finalP);\n  var nOthers = count (row, other, finalP);\n\n  for (var moves = 1; moves <= nOthers; moves ++) {\n    // the move is to push P forward by nOpens + moves (eg. nOpens + 1, nOpens + 2, nOpens + 3 ...)\n    row.push (getMove ({result, row, fromIndex: finalP, forward: nOpens + moves, player, other, open}));\n  }\n}\n\nfunction pushMove ({result, row, fromIndex, forward, other, open, player}) {\n  // What we want to do here is push the element at fromIndex forward by forward,\n  //   then fill the rest of the row up with [other].\n  var copy = row.join(\"\").split(\"\");\n  for (var i = fromIndex; i < fromIndex + forward; i++) {\n    copy [i] = open;\n  }\n  copy [fromIndex + forward] = player;\n  for (var i = fromIndex + forward + 1; i < row.length; i++) {\n    copy [i] = other;\n  }\n}\n\nfunction count (row, element, startIndex) {\n  var count = 0;\n  for (var i = startIndex; i < row.length; i++)\n    if (row[i] === element)\n      count ++;\n  return count;\n}","Oof! This is kinda ugly.","And all the girlies say I'm pretty fly for a white guy.","COOL","Yeah, and this is correct.","OOOOOOOOOP","OOOOOOOOPR","OOOOOOOPRR","OOOOOOPRRR","OOOOOPRRRR","PORROROROR","So let's do this again","Not counting the first two O's","OOOOOPRRRR","And I get the results:","So, I have valid moves of 5 forward, 6 forward, 7 forward, ...","I count the number of reds: 5.","I count the number of opens: 4.","Alright, so let's try it on OOPORROROROR.","This is >VALID<.","Because there's only one red, this doesn't run. My result is OOP.","For i = 1 to nReds - 1, I make the next indices an R.","P goes forward twice, giving OOP.","If this is JUST looking at POR, then ...","So, I push forward twice.","One open, one red.","For example, if I have OOPOR ...","Pushing forward makes the spot open & the next one a P.","Well, you can see that:","How do I get the result?","Cool so I have the count now.","So this would give the base case.","So yes, this would be correct (note this isn't formal, at all, but it's good enough for me).","You can do this for every red - so you can push 1, 2, ... for as many reds as there are.","Then, on top of all those opens, you're just pushing reds off.","If there's an open spot, pushing P forward, and any others that may go along with P, will just push it into the open spot. It would not push anything off the edge.","Now you can see this is correct because ..","Which you can see is correct. Two forward gives OOPR, three gives OOOP.","Which would, again, one open spot, two reds. So valid moves are 2 forward, 3 forward.","That would be what I'm looking at.","Any time I have PPORR, for example, I'm ignoring that first P. It'd end up being PORR.","Alright so what other conditions might I have","Veryyyyy interestin.g","Very interesting.","Each of these is valid.","Five gives OOOOOP.","4 gives OOOOPR.","OPRORR, OOPRRR, OOOPRR.","So the valid moves would be 3, 4, 5.","Two open spots, three reds.","PORORR","That's valid.","OOP.","Then you have POR, which would be push P forward twice.","ROPOR","Is this correct?","2) The first move would be the number of opens + 1. Second would be number of opens + 2. Etc.","1) Count the number of open spots and reds (other player pieces).","Algorithm would be:","So, let's see.","I can't build on top of it if it's wrong.","Because otherwise, I assume it works and if it doesn't, it breaks everything.","So, I have to prove this is correct before I can use it..","VERY interesting.","Second valid move.","Then, OOOOP.","This is the first valid move.","Third, OOOPR","Second, OOPRR","First, OPRRO","Right? So if I push P forward three times -","ORO","RORO;","There's:","Let's say I have instead PRORO.","INTERESTING","Four: OROR","Three: ORO;","And it was three or four.","With the other one, it was POROR","That's interesting: one R one O.","It's forward twice. One gives OOOPR, two gives OOOOP.","OOPRO","If I have instead","It's the number of open spots..?","How do I determine that?","So, it has to be three or four.","This is invalid for the same reason - nothing falling off.","OOPRR","Push P forward twice, what happens?","Nothing gets pushed off, so it's invalid.","If I push P forward once, what happens? An open spot.","Any of those are valid. So how do you get the moves?","Or I can push P forward four; OOOOP","Or I can push P forward three; OOOPR","But what if I have POROR?","That's the only one I can do, yes?","I can do OOP","I have the row POR","Alright os let's see.","Can you remember what it's like to care?","lmao programming joke","It's a string.","No, it's not.","Alright so I really don't know what \"5191\" means. Is it a number?","Just don't want this dream. Wake me up insideee","Don't worry. I'll be fine.","I don't want to feel the things that you do - the things that you do.","I've got the idea, mostly, so that should be fine","More work on that AI assignment","Alright so plan for today","Wake me up inside","c:","I already have my co-op for Winter 2019","COOL STUFF","o3o!!","And I mean that's good for me because I truly am greatness","Its just u having an audience to tell about how great u r","Whenever u go for an interview","Oh that's a good way of looking at it","But still couldn't go home :( poor parrot","It assumed it did something wrong and said \"I'm sorry!!\"","So then as the trainer was leaving (because it had to stay overnight)","But it couldn't go home :(","And the entire time it kept saying \"wanna go home! Wanna go home!\"","But then it got sick :( and went to the vet","And it was super smart at that stuff","If u showed him a blue triangle on a piece of paper, he'd say \"blue triangle!\"","That learned 150 human words & could tell colors, shapes, and materials","So there was a parrot","And also sad","Odang that's coooll","Like nobody's ever done..","I like the way that you look at me like Elf on the shelf","And like a bomb it all comes out...","<@209851879654555649> We've gone too far to give up now","Jk but I am a Geodude","I am geometry. Irl","And like a bomb, it all comes out o3o.","We've gone too far to give up now.","I tell her.","Meow irl","But I know I'm just a cat with bros","And then read back the notes and ull notice I'm actually insane and should be locked up","U shud takes notes of what we say","That would be fun","Just acting like we're animals","We're never gonna quit. Ain't nothing wrong with it.","OH","Who wants Partick??","Hio","I thought u were!!","WHAT","Ur actually a fish","Yes!!! I know ur secret!","I'm onto u Heegles","But it's not Heegles! Its Spongles!!","Heegles is smart","Ok 🗡","WE'RE GOING AFTER ZULE","🚙","QUICK KEYBOARD GET IN","🐝","Why do you own bees?","You hate everything about bees.","I hate everything about Zoos.","Do you know?","Why do we have zoos?","Fun fact - and facts as always are fun, but not always true - if you make a bowl of sphagetti and put it outside, two dogs will fall in love","Why DUI u say??? Because yolo","Or u can and u get arrested for DUI!!!","NOT ALLOWED","U CANNOT","I want 🏢","Hip hip hooray it's Weasel Stomping Day!","I'm highest bidder!","Sell me your watch, please.","Jk yes it is it's a bet","That is not.","HI","That's not me.","Scam","Dr. Evil is actually my best friend. He just doesn't know it","Oh but fun story","Tf r u even there for","But NONE OF THEM EVER DO IT","I've had ppl look at me which I've assumed to be a signal so I look back at them and give them their super secret assignments of killing Dr. Evil","Tf is looking at a guy supposed to do o3o???","So u drop hints. Like u look at a guy.","If ur female, u can't do that!!!","If ur male, u make the first move.","The whole dating scene thing","Oh u know what I hate","Ice cream","Aight so what else","Like gosh o3o. Ppl r equals and should be treated as equals ok thx","But if ur a female, then whatever ur female ur not pedo!","U can't look at the kid or ur a pedo! Tf u think ur doing?!?!","If u see a kid anywhere, and ur male.","Oh that 2","It seems to pop up a whole ton in dating and I guess that's where it's an issue but like o3o.","Not the stuff where women hide behind men, make men do things for them, blahblahblah..","Well men should be treated equally to women. Like if u want equals u should have equals.","Ppl keep talking about how women should be treated equally to men and how it's a total injustice!!!","RANT","Wholesome pokemans","https://www.reddit.com/r/WholesomeComics/comments/827goa/father_wholesome_pokemon_comic/?utm_source=reddit-android","THEY NEED TO LSOE THIS GAME COME ON","5:24 remaining and the Sens are up 2 - 1..","U HAD THAT","OH COME ON SPEZZ","FREAKING SCORE U LOSERS","STUPID DALLAS STARS","An Ajadi","<:wiggles:339591589594660864>","Debtt Me","Hi friends","DEBTT ME","Eggos.","My","Touch","To","Begin","Even","Don't",":/","We took a break.","They took a look.","Aight I can take a break I guess o3o","So I have a week to code that.","Alright, I think this should be good.","I need Nodes, but that's simple - you just kinda ... blah.","So I have my state. I have my production system.","Cool. So yeah, this'll be fast.","This is ideal, in fact.","This is all based off m, so it becomes O(4) => This is very fast..","If four moves are created, for example, then you have 6m steps to copy the array (of 6 elements), O(1) to alter it.","So, that's not too bad.","The copying time would actually be based on the number of moves - O(m), given m moves are created.","I build up the production system with how to create new ones.","So then I have an array, I do this.","Alright ...","Defs array.","Array.","No, strings are bad.","Or a string.","So the best thing here is an array ..","Aight, so I don't think it's actually possible to copy something in O(1) time.","If it's an array, however, it requires O(n) time to copy.","Note this is key of arrays.","Then I want easy alterations: I can just say position=type and it's done in O(1) time.","I'd ideally have a data structure to do this in O(1) time.","Note that strings are *easy*, because it's built in, but still require O(n) time to do this ...","Easily replicate - OOPPOPP should be easy to move to another separate state to alter.","Well, I want something where I can;","How should I represent the state?","That's what the production system should do..","So, you can build it up like that. That's how you build your state space.","Notice every one of these has to do with what the one just before it had to move.","For the moves from the first.","OOOOPPP","OOOPPPR","For the move from the second P;","OOPOOPP","OOPOPPR","Then, you can do either:","OOPPOOP","OOPPOPR","So you have the first move:","Is the row, before any moves","OOPPPORR","I messed this up","Which is actually the only move possible ... ok","So, OOPPOP could be OOPOPP, moving that second P forward.","Then, for the number of your own pieces in the board, you build up a new move on top of that other move.","You basically build your first move, which is the number of possible valid moves.","So you can build up the new move using that.","If, instead, there were two first moves - OOPPPR and OOPPOP (having two Rs at the end originally) then there'd be four new moves possible above that, which would have either PR or OP.","Every move is made up of the other move. If the first move is OOPPOP, then that P must ALWAYS be in the end.","What you can notice about this:","Each of which would push the R at the end off the board.","OOOPPP","OOPOPP","OOPPOP","So, for example, if you have the row OOPPPR, there's three valid moves:","2) Push at least one of your opponent's pieces off.","1) Not push your own piece off;","For a move to be valid, it must:","I have an algorithm here that'll generate the moves you can make from a row.","Aight so I've been thinking about Overboard for a while now","Ok so let's see","Ok I'm playing one more game of NHL 18 then I do stuff.","dang, yay!","If that's true, it's like..","From the ground up.","From the job description, looks like we're going to be building our own app.","I would love that.","Everything.","Full stack.","I really want to be in that CISCO position tho.","I was volunteering for an hour in the office of CCSS every week & they added me to the co-corricular record c: so now I can prove I do stuff outside of school.","Yay! I got something on my CCR!","That's pretty dang exciting tho my FIRST internship where I'm actually paid to do dev work and they luvvv me","I do.","Do I go for my Masters? Yes.","Until I go for my Masters.","Then I'll be done school 5evr","That's perrttyy cool","It's May 2020, which means I'm done in two years.","Also, had to look @ my schedule for when I graduate and dang.","Thing is I'd have to stop going to school & I'm not doing that o3o","So there's that.","She DID, however, say she'd take me full time.","But they're full, so no more co-ops this summer. Can't do it.","Asked her for a summer co-op","So I emailed my boss from the HoC","Hollyyy crap","HI OMGTHIS1","Its successor was the CD.","Cassettes had two sides, A & B.","Omg.","That was fun stuff","Anyway I luved that school","Plus the teacher was good friends with my mom so that didn't help o3o","I liked those classes","Olf I was nerd but it was funnn","They were planning to go have some fun but I left em bcuz I had to get back to class!!!","We decided to go across the street to Winners","One time I was hanging out with my friends at lunch","I was so evil tbh","Especially if he saw me when I was all evil c:","That is pretty cooool","That's my high school. Said he saw me around at the school.","Went to Bell!","But he knew me","(tbh, I didn't know him)","A dude came in","I was at my office hours today","OH FUN STORY","God is dead!","These riddles that live in my head. I don't believe that God is dead.","I watch the rain as it turns red. Give me my wine, I don't need bread.","Dorlors. Don't do it IT'S A TRAP","Two Face is my Griffindhor","Just ok?","Have I been bad or just ok?","The voices echo in my head.","Give me a timeout cause I've been bad","Don't do it Bahdegs Gay Slave","Legit tho Thomas is king of torture","Its a lot of work for only a little myosin","Ppl let me in the Sky world. But only for a day or twi","Oh it's earlier my bad","Thomas. Whoever that is. Tell her the Caps r ok but not great","HI SPONGEH","Thomas who is that?","I miss Rock Humboldt","Going to Montreal for Al is like, ultra yay.","You know, I went down to Montreal for Sabbath and that was great.","Running as database heads. Iron Man has a coupon!","Heavy boots of lead. Fills his victims full of dread.","Idk none of these sound professional","\"Kuldip\"","\"I am glvoe and you are hammer\"","\"I'm off on sick leave\"","So what do I say","Can't say \"I'm skipping town\" bcuz TAs don't do that","Me irl","Fill up my mind, Jef.","And there's probably plenty more.","You have closed your store.","Is it open? No it's not.","As you close your store.","Why yes I'm open.","I am Open Man.","HEWWWO","I am iron man.","FREEDOM","freedom to talk","freedom to rock","aight well freedom is mine","the problem? idk what a lcokaf is'","GOSH I JUST WANT A NEW LCOKAF","ok now it's 2:50 so ten minutes","lots of stuff but really simple","blahblahblah","then u have other ruels","or y is the mom of x","so if y is the dad of x","family(x, y):-mom(x, y)","family(x,y):-dad(x, y)","U have rules","It's all like","Prolog is fun","And nobody likes Prolog but i love Prolog","But to be fair they said 3007 was hard and it's easy!!!","That's gonna be fun to take next year","Ppl talking about how the final for 3004 is brutal","I MISS YOU, MISS YOU","So, it's 2:43. Lmao can you believe taht? Probably not - becuase I'm LYING it's 2:44.","What's my age again!?","What's my age again?","My friends say I should act my age.","Nobody likes you when you're 23.","And that's about the time that b* hung up on me.","HI FRIENDS","I called her mom.. From a paypohne.","Later on, on the drive home.","I see my Mary Ann walking to work.","WASSUP","Heeg.","HI","Ok, so I have some students not doing a question correctly.. and idk if it's 0 or what. O3o.","Its a piece of paper. o3o.","I tried to swipe the midterm to scroll down","I'm marking midterms","Omgggg I just did the stupid","Char ... 😦","Char? Mander!","Charmander!","Char man! Char! Char char! Charrrr!","Char... Char! Char!","Char...","Yolo.","You know, I'm not realy interested in doing anything right now.","Anyway. I'll figure it out.","Rip me.","Gosh, this is something you have to think about BEFORE you code.","Although, crap, no, that doesn't work.","1) What is at the position (3, 0)?","Well, there's conditions.","Can you do that?","So, let's say you're at 3, 3, and you want to push it up.","First, it's probably ideal that I manually code in what the end points would be - so it's a constant time O(1) check rather than being computed, taking time.","Say you're at the position 3,3, and you want to push it up.","Aight so my thing here:","Me?","Pikachuuuuuuuu","😦","MAN! OH, WOW! YES!","Gosh school internet u suck","Skipped over Ash losing Pikachu, which makes sense. Because you don't have enough time to make it real and if you don't make it real, you shouldn't show it.","It had Ash leaving Butterfree. 😢","Had so many throwbacks","I LOVED this in the theaters. Great movie. 10/10","I CHOOSE YOU PIKACHUUUU","Yay!","School internet just took a while.","YAYAYAY","OH IT DOES","Which it doesn't CRAP","Assuming it works on mobile.","Which is OFFICIALL","It's free from Pokemon TV","Ok I gave up. Pokemon I choose u","But this thing online is slowwwwww","There's no streams on Terrarium so I had to find it online","Gash","Bcuzzzz yolo","Aight so I'm watching Pokemon 2000","Alright so my theory: WAFFLES ARE EVIL AND SHOULD BE TREATED AS AN EVIL LIFE FORM RAWR","<@!132364526942158848> Who's Rozeeta","rozeeta","We need to take back Mars from the dogs.","DOGS.","But, the life?","We've detected life.","For my next mission to take over Mars.","ALL OF YOU","I want YOU","<@!320487777559117825>","<@265163518842634242>","<@!132364526942158848>","I want YOU","I've got my AI assignment due next week. Do I have anything this week? Yes - OS..","Ok so let's see...","o","Lmao but it's Monday XD","Alright off I go bye friends have a wesnesdyay","First thing tho is to grab my midterms.","So I assume my plan for today is final project. I'll have to see, I guesz","I'm running down a dream.","Yeah I'm running down a dream. Whatever will come to me. Working on a mystery. I'm going whevrer it leads.","I felt so good. Like anything was possible. Hit cruise control and rubbed my eyes.","The last three days the rain was unstoppable. It was always cold, no sunshine.","I'm running down a husky.","HI SPONGE","A little runaway. I wasn't blind.","Trees went by. Me and Dale were singing.","I left the radio on; I was driving.","It was a beautiful day. The sun beat down.","All I know is this is probably the first time I studied for something and it worked.","I knew 19 of the 20 words on the quiz. Two got me cause I forgot the symbol, should've practiced writing them, but #LiveAndLearn","WOW THE SYSTEM WORKS","I'm not guddness but I am a cyborg transformation sequence.","Uniformed Ant Receptors","Good morning UZA","Hi Amx","Good morning USA!","Good morning USA","Oh boy it's good to say","Good morning USA. I've got a feeling that it's gonna be a wonderful day. The sun in the sky has a smile on its face and it's shining a salute to the American race","Steven Spielberg","My name is Steven","Hey babe what's ur name ;)","Yes you do","Wassssyp","Hi Toxic","ME","Ok I'm going bye","Now I could leave, but I won't go. But it'd be easier I know.","HIO","Say we'll be together to the end??","There ain't noone who makes me feel like u do.","There's no point in trying to pretend...","You know I luv u more than I wanted to.","HI SPONGE","Can't feel a thing from my head down to my paws.","But it'd be easier, I know","I could leave, but I won't go.","If you wanna get down - down on the ground. Cocaine.","I should have learn d to play the guitar. I should have learned to play the drums.","HIO SPONGEO","We've got to move these color TVs...","We've got to move these... Refrigerators.","I'm gonna have to go see my prof today anyway so whatever I'll ask him","o3o","So Carleton is on strike & I have no idea what I'm supposed to be doing","SUP","GUYS","THEN WEDNESDAY IS WEIRD DAY YAYAYAYYA","And I think that's everything? And I got my office hour at 3","So, we'll be fine. But it's massive. I'll start it tomorrow, I'm thinking..","- Operating Systems final project. This is MASSIVE... But I have a partner and we have six weeks.","- COMP4106 A2, which I was supposed to get started and didn't, due in ten days (this one will take a while...)","- COMP3804 A2, which is a bit tougher, due in two weeks","- Operating Systems Exercise 6, which is small, due this weekend","Then I can work on an assignment. I've got the choice offff","Then I gotta go to my prof's office, pick up a stack of midterms.","9:30 AM I gotta do that.","Got my Japanese test first thing.","Anyway what do I need to do tomorrow","Evil I say.","Because THEN... once u get ur degree.. U won't complain about having to work.","They make u do all this stuff where u don't have enough time to do everything","EVIL!","OH YOU KNOW WHAG THEY'RE EVIL","Full screen rockingggg it","HI","I swear. If uni teaches anything, it's how to balance billions of deadlines for a week o3o","Oof. That's a lot of stuff being pushed onto the pile.","Assignment for next week, midterm two weeks...","I've gotta mark midterms.. and an assignment.","Eep.","I am so excited to be known as the one who likes cheetos berries","I can't get them out of my heaaddddd","In my whole life, I've never had a bad cat.","God knows I try, but I just can't forget.","HI TOXIC","Can't get you out of my HIGH","Hi ! Hi! Hi !I AYE!","I! I! I! I! I! I! I!","That I ... I ... I ... I ... I...","And I need you to know.","You won't let me go.","I'm thinking about the love I threw away. Threw away!","I keep trying to sleep but I'm lying awake.","Maybe we're not meant to be..","And I... I'm starting to see.","Maybe we're not meant to be.","And I... I'm starting to see..","I can't give you what you want, and it's killing me.","It's like trying to turn around on a one-way street.","And I.. Can't change your mind.","No matter what I do, you're always mad.","Oh, it's like one step forward, and two steps back.","Nobody wins when everyone's losing.","And it seems to be the story of my life.","c:","I've gone over everything. I know all the words I ahve to know.","Yeahayaya","Bcuz I kinda haven't cared to look for one ... and I need one o3o.","So, hopefully that's still an option.","She said if I wanted an internship for the summer, just to email her & I'd be able to come back.","I emailed my boss from the HoC.","Oh, so an update","Got our backs against the ocean. It's just us against the world!","I know that I'm good for something, so let's go and give it a try.","Looking at all or nothing! Baby, you and I.","This is it. Baby, you're all mine.","With you, I know that I'm good for something, so let's go and give it a try.","Looking at all or nothing, baby, you and I.","So I'm comfortable with all the verbs.","Yayayay!!!","Anyway. More examples that ppl r insane.","Whereas if it's a male teacher, you're getting massive backlash for it.. but it's ok bcuz it's a male o3o.","And all the comments are like \"ha! nice!\" or \"good for the kid!\"","A female teacher, 26, was sending nudes to a 14-year-old kid & had sex with the kid.","THAT IS ALSO INTERESTING","Not two. You want to go with a friend? Sorry, nope! But you can go alone.","There's exactly one ticket left.","Alan Doyle is playing a show in Saskatoon","Lol that's interesting","No, it's nothing new. It really sucks to be you! I f'ing hate my life.","So much at stake... Can't catch a break. I hate my life.","Nothing turns out right. There's no end in sight. I hate my life.","I hate everyone to the bitter end.","I hate my job, all of my rich friends.","Go on and say F YOU","Yayayayay I think I got it guys","///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////","Taberu is to eat; miru is to see, or to look at; okiru is to get up; neru is to go to sleep; tanasu is to speak; kiku is to listen; yomu is to read; nomu is to drink; iku is to go; kairu is to return","Ok let's try this again one more time","Miru is to see or to look at.","Tanasu.","To speak is to tan a su.","Tan a su, actually.","To speak is to tan.","Tanasu.","I had to look it up again gosh darn","tanasu.","this one keeps messing me up","To speak? ...","To return? Kairu.","So, let's see.","I need to remember the words now .. I know thier meanings.","Iku is go; kairu is return.","Yomu is read; nomu is drink.","Kiku is listen.","Tanasu is speak.","What are the other six ...","Neru: To sleep.","Okiru: To get up","Miru: To see; to look at.","Taberu: Eat.","So let's try it again..","There's ten of the twelve verbsI have to know.","Kairu is to return home.","Iku is to go somewhere.","Nomu is to drink.","Yomu is to rea.d","Kiku means to listen.","To speak.","Tanasu means to ...","Neru is to sleep.","Okiru is to get up.","To see; to look at.","Miru means to ...","Taberu means to eat.","Alright, so;","So fine, oh, you run. This time I let you go.","This time, I let you go. Go!","So fine, oh, you run.","'Cause I can never set you free.","You wanted a soldier, but it wasn't me.","Maybe I'm blinded by what I seek.","Maybe I'm crazy. Maybe I'm weak.","Worlds apart, we were the same until we hit the ground.","I'd go to hell and back with you, stay lost in what we found.","With the touch of her skin...","Made me a believer.","Heaven forbid..","I'm in love with an angel.","😦","And I actually remember things IT'S WEIRD","Memory exercises","I've been doing like","So guys","And no, there's never any coming back!","Everyone looks so hot right now.","Your priest is hot right now.","The president's hot right now.","Too bad that shit don't work, though.","All the flavours of the rainbow.","No homo","I love you","DevF","Guy Boucher","Hi AMx","I guess I'll sit around and medicate. Medicate!","I am so freaking bored. Nothing to do today.","Why oh why does God hate me?","mm mmm mm","mmm mmm mmm baby","Fine. Everyone gets one.",":/","That.","Touch","Don't","Lmao","But wowzers I know the other stuff o3o","I've gotta memorize 12 verbs for tomorrow.","Ok so it's 12 verbs.","c:","So, I've got ~10 verbs to memorize, and then I shoulddd be good","I've got all the katakana words down.","Yay!","I miss u","Don't waste your time on me, you're already the cat that has no pants.","She never told me she had no hands","I can't believe I'm muted. That's #rude","did you know ahoy comes from the words \"a\" and \"hoy\" which roughly translates into \"one hoy\"","ahoy","Hewwwo","o3o","I actually remember some Japanese words","So it's interesting","So o3o.. Trump strikes again","And Trump was talking about \"Oh, it's great! We should do that!\"","China's gone with a \"president for life\" system now","Ooo dang","","https://twitter.com/BradyTrett/status/970142875328528385?s=19","But it's ok, because all 35,000 fans took their phones out and are shining their flashlights!","The lights went off & they cant get them back on.m","The Toronto Maple Leafs are playing an outdoor game in Washington against the Caps.","OH MY GOD THAT'S AWESOME","Normally that'd stink!!! But with the Sens way out of it that's great Coyotes gotta win!","Ooooo Arizona scored, it's 2 - 1 Coyotes","...other words.","Kutsu is shoes","Kurama is car","Jisho is dictionary","Tokei is clock, or watch","Shinbun is newspaper","Hon is book","I actually know some words now.","Yay!","o3o3o3","But hacking ur mind","This is like hacking","I'm actually memorizing stuff o3o","Wow dang","SENS GAME IN AN HOUR","So what? I'm still a rock star. I've got my rock moves. And I don't need you..","Oof my head hurts it has the ouchies","Does that mean it's alright if I post it ???","https://gist.github.com/pjvandehaar/f360193d8a9bdf4ba550","But I just Googled it and there's a solution in the top three reuslts.","(Because they're all online)..","My prof for AI asked the class not to post our solutions online, because he has a hell of a hard time finding problems to give for assignments ...","Aight guys so I've got a moral dilemma.","HI THOMAS","o3o","DANG that is a good line","It's just you and your hand tonight.","Keep your drink, just give me your money.","Before it begins.","You know, it's over.","Hi guys.","But you're going home alone, aren't ya?","High fiving, talking shit..","You know who you are.","You're making me ill..","Instead of making me better, you're making me ill.","You're just like a pill.","To the middle of my frost tree scenes, and I swear.","To the middle of nowhere.","As fast as I can.","Where I can run.","And I'm good. I reached ~ 3/4 of a page.","Went through and explained the heuristic in more depth, explained that some conditions are more important - for example, taking many prerequisites would be more important than a balanced schedule - but each would be taken into consideration..","Aight there we go","aww man my ouchies","😢","But I'd give ... your memory, you'd visit me in my sleep... My darling... Who knew?","I wish I could remember.","As time makes it harder..","The last kiss.. I'll cherish, until we meet again.","I'd stand up and punch them out. 'Cause they're all wrong, and.","If someone said three years from now, you'd be long gone.","Gah","But he said to keep it brief","It's only about half a page.. It's supposed to be 1-2 pages.","Alright so I got my proposal written but","So blah, I guess I'll do it in Word today.","He accepted it but clearly wanted it to be done in Word or whatever..","I wrote my report on paper last time and the guy wasn't super happy about it","Ohhh right","Please someone... I just want to go back home..","The whispers won't stop, don't let me be alone.","what that means","anyone have any idea what that is","I have an assignment where I'm supposed to explain the \"Description of Problem Domain\"","Idk if any of you guys would knwo this but","Yo guys I got a question","Let's get started on that proposal.","Anyway!","(Btw, I never should have taken Japanese... I'm learning a bunch but I'm doing horribly in the class because I don't study & without studying this stuff is impossible rip!!!)","- Japanese ... Got a test on Monday so gotta prep for that.","- Assignment 2. I doubt I'll get it all done, but I can at least get started on it.","- Project proposal. I'm going with option (3), the schedule thing.","So, ideal stuff to get done in the next little bit:","Alright so I played an hour of video games so it's work time.","And, like, it'd be fun.","I am actually really hyped about this project now. There's been a huge problem for me with scheduling (I have to keep going back once the semester starts because I didn't think of something) & this would solve it.","Good","Aight","That's my AI Problem.","I'm gonna go for that. Many courses. How should I schedule it?","Given I only have a month to solve this thing - and a month probably wouldn't be enough time for the natural language generation thing, given I also have other courses & other projects to work on.. AND it's a course covered as a Grad course because it's pretty intensive ...","And that would likely be a MUCH easier problem.","And that could be something an AI would solve, and that sounds MUCH closer to what the class was discussing.","Which one do I take?","But if there's many of these - where COMP3007 might be the prereq for a few courses, which are the prereq for others, and COMP3000 same idea ...","So, the ideal solution here would be COMP3000 - that way, in the next semester, I can take both COMP30005and COMP3007.","If I can choose one of COMP3000 or COMP3007, which should I take?","COMP3007 runs at the same time as COMP3000.","COMP3000 is a prerequisite for COMP3005; if I do not take COMP3000, I cannot take COMP3005. I also cannot take COMP3005 until the next semester after I have completed COMP3000.","So, for example, it might be structured like this:","Each of these run at separate times, some have prerequisites for others, etc.","There's a whole bunch of classes I need to take - eg. COMP3005, COMP3000, COMP3007, COMP3804, COMP3004, etc.","A third problem I could work on:","Although ..","Maybe I should email a TA","He's said before to avoid emailing him o3o..","I'm half thinking I should email the teacher to see if it's valid, but he doesn't like emails, so idk.","So, I think so. I think this is enough.","3) Develop the algorithm for combining sentences","2) Create the initial generator & initial rules","1) Figure out the different categories & feed them data","Here, I'd have to:","A second assignment is to play the game Overboard using MiniMax and Alpha-Beta pruning.","One assignment was to build the peg game & solve it with BFS, DFS, A*.","Now, he wanted it to be the size of two assignments. Would that be two assignments?","And that's why it'd be an AI project.","And that is a valid sentence, so I'd have a valid result.","If I take the first two words from the second sentence, and combine it with the last three words of the first, then I'd end up with a sentence \"Dog runs towards the barn\"","Say I have a sentence \"I chase towards the barn\" and \"Dog runs at brown bunny\"","So, I can use ... I forget what it's called ... But I can take another sentence and sort of combine them.","And that's close to a strong English sentence, but not quite - a better one would be \"dog runs towards brown bunny\".","It'd be with the generating of sentences. I'd start off with a sentence like \"Dog runs at brown bunny\"","So where does the AI come in?","Gosh, if I do this, I really have to go back to high school English. eeek.","So you'd give them different categories, and those different categories depend on the subject of the sentence.","Which are off.","Because otherwise you'd get sentences like 'Dog run to mall' and 'I runs to mall'","For example, the verb 'run' would be a different category from 'runs' ...","The different kinds of adverbs, verbs, adjectives.","You take a whole lot of English words. Parse them into the different categories - plural nouns, singular nouns, pronouns, etc.","My idea is basically:","Mk, so going back to my AI stuff","Excellent teacher. Absolutely loved him.","And I loved it.","Like it's crazy how high end that class was","And then in university when I started learning this stuff, it was all the same stuff I learned in that class... even now with taking 3rd & 4th year classes, there's still a lot of overlap.","And anyway I loved that course.","I know at least one of the guys ended up doing pretty well on the final exam, I think the other did pretty well 2","Idk how well they ended up doing but I tried to help them.","He put me with the two kids with the worst grade in the class, sort of to see if I could help them out","And then my summative project!","And that was super fun","If ppl had questions, they could come to me & I'd help out","He ended up saying like","But anyway","And I never told him, but like 99% of the stuff was the first time I had ever seen it","I was grasping the stuff rlly well (to the point where the teacher thought I had done it all before)","In Grade 12 when everybody was struggling in the course, like legit -everybody- was struggling","Ok so I wanna brag about some stuff","Dodle Piggle *","Thx Dodle 😃 have gud day","He was teaching how to write code on paper, how to read algorithms, how flowcharts work, how to debug code on paper..","It was like a TOTAL flip","And in Grade 12","And then we got into Grade 12.","People took the classes because they were easy As and you could just watch YouTube videos every class..","We'd have a week to create a program using an if statement.","And basically every Monday would be a five minute \"This is an if statement\" thing, and then we'd be given a project.","In Grade 10 & 11, they taught us Turing, which is a super simple language designed just to help people learn how to program stuff","I have a fun story about my high school comp sci","I like Python","Ooo Python","Kool","R u in the top level one?","U shud love thems","If your comp sci courses are like what I had","Ooo cool","R u in high school?","I have to have a finished product by April..","So, I get the idea today. I write my proposal.","Tentative Due Date: April 16, 2018\nProposal Due Date: March 7, 2018","2) This be easy to make? It has to be something I can make in, at most, a month.","1) The teacher be alright with a final project in Natural Language Generation, which isn't quite the idea of the course;","So the question is would:","c:","I chase after the Dodle Piggle.","Also that is true.","And could entirely be an AI question.","Then, that, would be some AI, I think..","brown monkey: a noun, preceded by an adjective.","with the: sentence connector.","I run: Object, verb.","I run with the brown monkey.","Then you build larger sentences with it.","I run.","Dog runs.","I simply give it some rules. It should have object verb, for example..","But if I don't give it that \"a sentence should look like _______\" format -","That's the issue I'm having.","What's the challenge here? Where's the AI?","And you write code that just randomly places some of them into the sentence.","You just put in the words & formatting yourself,","With a sentence generator, it's really, really simple.","And different searching methods.","With the class, we've had puzzles, games, ...","The issue on this one, which I'm not sure about, is it's not quite the AI we've been seeing in the class.","So, here, the real challenge would be just to write some sentences. Make an AI capable of generating English sentences; the rest is just extra.","2) The sentences should be proper English sentences.","1) It should make sense, follow a theme, whatever..","The rules here would be:","There is no rule that it must rhyme. There is no rule that it should sound like this.","The beauty of a story is you're missing that first rule - the syllables aren't important.","Something that'll tell you a story.","2) Natural Language Generation.","So, that brings me to my second AI ...","And that's why I'm thinking this ISN'T the ideal problem to work on.","And, in that case, that's where you're going to have to take months to write the program - to actually piece out what's what, how the English sentence would be formed, etc.","And that makes no sense. You want it to be an actual sentence.","The simple AI program would give you something like \"Miss two a it\"","Now, the issue there is .. Even with that, it should be a sentence that makes sense.","So you ideally have the theme & the song.","I mean, it kind of does. But it doesn't /really/ follow the theme.","So, if I have a line \"Wish you were Beer\", it shouldn't be followed by \"Demons took my soul / Gave it to a big mole\" because it makes no sense.","2) It should follow a theme.","That'd be a good song imo.","Then you write a song about beer and how you love beer and wish you were beer.","You can, however, rewrite to be \"Wish you were Beer\" and that works.","1) The syllables should be the same - this is KEY. Like, if you have the line \"Wish you were here\", you can't rewrite that to \"Wishing you were fishing\" because the syllables would be off throwing the entire song off.","There's two challenges to parody, really:","Meow irl","1) Poetry Bot. You plug in a song, it takes that song and writes a parody.","My ideas so far:","Aight so I need to find an AI problem to solve as a final project.","So I need an AI thing.","HI SPONGEH","And then AI solves it ...","He gave the example as you're a school bus company. You control how school buses pick up students, what times, etc. Given this data on students, what's the best time to pick up students?","What should I do? What's a good AI problem?","I need to find an AI problem I can work on.","Guys help me out","There's a reason they're the best team in the league o3o they r op","Stammer had five points & the shootout winner. Dangzois.","Great play by Provorov, dang.","TIE GAME! AT 6!","GIROUX!","He couldn't quite explain it... It always just been there.","He.. found.. that Mr. Happy was missing.","And when.. He finally came to.","Made his wife so mad one night that she cut off his wiener.","There was this guy, who","Once","This game's fun.","Philly v Tampa, tied at 5.","You know how that ends. BAM.","Stamkos - Klutcherov in on a 2-on-1...","Ppl explaining burnout and it sounds like what I had at the HoC o3o","Oof! That's kinda freaky.","MEOWER. MEOWER. MEOWER","'dog' DOES NOG COMPUTE. MEOR","I AM A STARFISH HEAR ME ROARRRR","*transforms*","Hiiii","TRANSFORMATION SEQUENCE GOOOOO","HI SPONGE","I'm not kidding: I am a cyborg transformation sequence and I have come to transform myself into a starfish..","🐧","Gives you club penguin power","Hi friendos. Heidi Klum today amirite?","She was a mime...","She never told me.","Can't you see this is the land of confusion?","And there's not much love to go around..","Making too many problems.","There's too many men... Too many people.","You can't do that. Its infinite. For every number you count, there's a number higher than it.","But if I say count every number.","I can say count to 10,000, or 100,000, or 1,000,000. You can do that.","So, for example, let's say you're counting. 1, 2, 3... Etc.","So an infinite set.. by infinity, has no end. It just goes on and on and on.","Infinite Sets.","Ok, so I'm going on a rant.","HI SPONGEH","But I already knew that stuff!!","Ended up reading about countable & uncountable infinite sets","Went to a Reddit thread about \"what makes no sense\"","Me irl","HI","lmao \"oops\"","oop","pO","It took so long to say ... You walked away from me. When I need you.","Until you see this side, do I... I don't want you.","You push me down.. at least you tried.","I'm not angry all the time.","Wake up. I'm pounding on the door. I'm not the cat I was before. Where the hell are you.... When I need you?","Dodle.. dodle. Wake up.","Wake up.","Get into the basement and yell at random people that go by your windows","Is what he would say.","He always told me - \"In twenty years, you'll see a man named DevF. Ask him.. if he's gay. If he answers no, then I'm not, either.\"","Then no, I guess.","Idk. R u?","I miss him.","Well... I'd like to say it's still possible. But alright, I'll assume you're not.","Yeah, Dev Frederico. That you?","DevF, are you Dev Frederico? I knew him well until he disappeared twenty years ago.","Hi DevF. HI SPONGE","Jk, it's not kid friendly. It's filled with heat 🔥 🔥 🔥","You want a kid friendly world come to my world!!","SUP","Mk off I go bye","Other is just a mess of my other stuff that's completely urnelated to anything, because I was bored.","Personal > Other","Personal > Hack-a-thon","Ended up actually implementing a category for hack-a-thons 2","Aight so I've gotta go to class but I'm liking this now I've got the idea.","I think that sounds nice, and as part of that, there's now a reason for bullet points. Bam.","\"name\": \"Advent of Code 2017\",\n            \"points\": [\n              \"Various challenges released at midnight EST, every day from December 1st to 25th\",\n              \"Thought through, designed, and implemented solutions for the problems\",\n              \"Developed solutions using JavaScript and Lua\",\n              \"Completed all of the first 18 challenges, hoping to complete the rest later\"\n            ]","See here's the problem. Do I want these to be bullet points, ala a regurgitation of my resume, or should it be friendlier? Is this a professional website?","The main thing, though, was working in a large codebase, performing maintenance and keeping the clients happy.","I updated a TV Display App. Basically, you'd add in any PDF or PPT files you wanted, and bam! Displayed on TV.","I built applications. JavaScript, Visual Basic, Visual C#.","House of Commons:","Ok so let's see.","Thank u a blog from 2004.","Wonderful.","Which means that, yes, my experiences at the House of Commons & whatever are worth putting in here.","Explain why it's fun and challenging.","Highlight the cool stuff.","No, you don't have to be working on a web application or website to have something worthy of putting in a portfolio. As a fellow developer, I can appreciate the beauty of a well-designed console application, or a clever applet with hardly any interface at all. If you've written code you're particularly proud of, show me that.\n\nThe portfolio is important, but what's more important is that you are excited about what you worked on. If you took the time to highlight the cool stuff and bring it with you, that already puts you far ahead of every other candidate I've ever interviewed.\n\nIf, on top of that, you can effectively communicate to me exactly what made your past projects fun and challenging to work on, then heck-- let's get married. Or at the very least, let's work together building something cool.","Oh, dang,.","And I can sort of see why, tbh - I've got all this work experience but it's all sort of a regurgitation of my resume.","So that's interesting. I'm looking at a whole bunch of web portfolios and it looks like, for the most part, people have been including their resumes & projects.. and not much else.","MEOW IRL","And, therefore, must die. Goodbye.","I legitimately don't want cheetos","Win... Or lose.","Those are your two options.","Win or lose.","Just remember, Thomas.","But whattt","It should be an actual thing","It shouldn't just be what I have on my resume","Ok so now the issue is what do I put here :/","For hack-a-thons","Category -> Experience","For Work, School","Category -> Subcategories -> Experience","Ok so I have it set up like this:","Which means I'm leaving byebye friends","Mk I'm gonna bother with it later","Only thing I need to do now tbh is to make my Experience page, but I don't feel like it rn.","Think I kill them lol but I don't I beats","People on the streets","might legitimately keep it like that lol it looks nice","","Changed my pic to Thomas CHabot","Me irl","For the record, I am Chabot.","https://github.com/Thomas-Chabot","Yay!","So now people can go directly to my Thomas-Chabot profile","Added my GitHub url onto my About Me page","<:wiggles:339591589594660864>","NOOOOOOOOOOOOOOOOOOOO","NO","HI SPONGE","This cat won't desert you.","And if he ever hurts you.","I really love you Hasan.","I still love you Hasan.","You know I still love you.","EWW","Hey","Hey","Hey","There we go. Applied a minor refactor & the ProjectsMain page (which handles the categories) is more globalized now, so my Experience page can use it (without saying include projects because that would be weird)","Although I think I have that figured out, so I'm fine.","So I kind of hardcoded it to go to projects. Can't do it here.","Projects is easy - I have two categories, from there, it's projects. There's no \"this one goes directly to the project, this one has sub-categories\"","So now the question becomes, what best way to break those up?","But anyway, I like it.","I'll figure that out.","If not, well, idk.","Maybe a picture or something on the side, if I have one.","- Point 3","- Point 2","- Point 1","NAME                                                                 Dates","These will all be bullet points.","Each main one - for example, my experience on ODS, what I did at a hack-a-thon (eg. CUHacking), or a class whatever","Hack-a-thons will just have a listing of the hack-a-thons I've participated in, when they were run, and a link to my GitHub (if there's a project for it).","School will have TAing, Schoolwork","Work will have QA, Software Dev","Inside Work & School, there's gonna be a second category page.","And that's gonna have the same design as my category page for projects does.","On the main Experience page, I'm gonna have the three headings: WORK, SCHOOL, HACKATHON","Guys I got it","o3o","But most importantly I want to design my site","Plus I'd have to go professional every day, over the summer, and it's going to be hot. I don't want to wear jeans and a fancy shirt in +40.","They said they'd take me back, but it's pretty late to ask for it now.","Because I need it for two months from now.","?","Kind of wondering, tbh, if they'd still take me @ HoC. Is it too late","But I want to volunteer and I don't want to co-op.. o3o..","So, realistically, I should apply for a co-op rather than applying to volunteer.","In order to apply for a co-op, I have to submit a cover letter and a resume.","In order to apply to volunteer for the SSSC @ Carleton, I have to submit a cover letter and a resume.","Fun Fact:","I want to volunteer tbh","Or I work on my site?","I apply to volunteer for sssc","Guys what's more important","I got class at 2:30 so it's time for some stuff","Aight Guys","Once I have that I'm a super duper lemon scooper","And design","My big issue is figuring out format","Thx!","Although, only hackathons, so I'd call it hackathons.","And then under personal would be... Hackathons.","A whole bunch of those. Maybe I should split it up to QA and Dev, idk. Hi Dodle Piggle","Under work, it'd be internships.","Under school, I'd basically have TAing, Clubs (although I'm not in any!!!), ...? Other stuff.","My experience basically has three main categories: School, Personal, Work.","Alright, so I'm thinking:","Ok I go now bye friendos","Yeah, whatever. We don't care","And they were just like","Just by going through Skype","They have a massive flaw in it that literally anyone can do anything they want on Windows","And now it's full of hackable potential","Ikr!","But I haven't been on Skype so idk","I think I still have him on Skype","Yes Sidd is great","Also who's Hyndman","Does that make me Hyndman?",":o","I've got work experience to make still but it's almost ready which means I'll actually be able to use it","I've got my about me page done & projects are done","It's going a lot better than I thought it would o3o!","TOXIC U JUST MISSED BRITNEY SHE WAS HERE A SSCOND AGO","HI TOXIC","HI SPONGEH","Hi Britney!!!","Hio friendos","Baby, I've been sleeping with your sister.","The checks in the mail! Hey, you're beutskrufl. Don't ever change.","OH TRUST ME","You know what I mean.","The checks in the mail! Would I lie to you??","Well baby won't you sign on the dotted line? It's gonna make your dreams come true.","Well sorry, gotta run, well get together again. say what was your name anyway?","Well hey how ya doing have a seat have a drink. Boy it's good to see ya what can I say",":(","That every day's a rerun and the laughters always canned...","Oh Andrew what a pity don't you understand?","Oh pls Andrew pls, let me be in your show, Andrew! Ahh","Oh Andrew what's a girl like me supposed to do? You really drive me wild when you sing your bob-a-loo.","Hey Andrew!","Hey Andrew you're so fine how I love to hear you whinneee!","HI ICY","Well what's the matter little Lovey? You think your birthday's in the May! Celebrate while you can because well soon be blown to bits!","There's garbage in the water. There's poison in the sky. I guess it won't be long until we're all gonna die...","Hi Woof","Happy birthday to u","Happy birthday  <@184733731477520386>","AND EVERY DAY IS A DAY CLOSERRRR","WHICH MEANS WE ARE SUPER CLOSE TO WEDNESDAY","I am #excite for the record BECAUSE WE ARE NOW ON FRIDAY","The lyric sheets so hard to find. What are the words? Oh never mind...","HI SPONGEH","What is this song all about? Can't figure any lyrics out. How do the words to it go? I wish you'd tell me. I don't know","Hello","Ok so it smells like Nirvana kinda tbh","HEY!","ALEXANDER! ALEXANDER! ALEXANDER!","ALEXANDDSSEEEERRRR HAMMILLLTON!","Just you wait... WHAT'S YOUR NAME, MAN?","For the record, it's great.","MEOW IRL.","LISTEN TO IT","GO TO SPOTIFY","The Hamilton Polka IS OUT NOW","Guys","OMG NEW WEIRD AL POLKA IS OUT YATy\nAyyYahaba","Aight, cool. I'll work on that tomorrow.","I think that could look nice.","Hack-a-thons would be the various hack-a-thons I've participated in & what we made.","Work Experience would be my internships..","Carleton would feature TAing, Open Data Structures, tutoring.","Have headings, like I do on Projects. Off the top of my head, they'd be Carleton, Work Experience, Hack-a-thons.","Ooo, idea for my Experience page:","This is coming along super well tho. I like it.","Gonna need to figure out something to put on my Home page & how I want to format my Experience page. That'll be something I work on tomorrow / later","Rest of it stays the same.","I'm good with it. Made a few changes (had an issue on smaller sized screens) so the Facebook and Send an Email are on separate lines.","So, alright.","Lmao","I love Cheetos.","Any way to keep it same line with the text?","If I have an element:before adding an image","Ikr c:","Ok M1","Who's a CSS wizard","Yo guys I need some tips again","So I've gotta fix up the Experience page - get an idea implemented for that - and the Home page.","Oh and removed the Contact button","","I think this one looks good enough","Final draft","ikr! it's all wiggly!","","with a pic","tbh","I like it th","","This is what I have so far","Ok, started on the About Me page.","Cool","Oh hey I got it","Any way to do that","So if my width is 90px, height should be 90px.","It needs to have 100% width, and whatever height it needs. Should be 1:1.","I'm trying to make an image maintain it's aspect ratio","Anyone here a CSS wizard","Hmmmm","😢","I AM NOT RUDE","The unsuspecting victim of darkness in the valley.","There's shadows in the backgroiund of the morgue.","There's angels in my nightmare.","Anthony, sleeping is good for you but","I miss u","HI SPONGRH","That's how they get ya.","This song is NOT a song.","Morning, Adam.","He's crayyy","I think that's like 23 straight games?","Taylor Hall scored a goal again","Lol dang","https://open.spotify.com/album/24kjyGW47XaNL3AqyaEL07?si=_QoZ5HeAQSqZ_FSPGeSuZA","But you can hear the... Results.","Well you can't lmao","You want to read it?","I wrote a diary.","In fact, I WAS a spider.","That's not what I'd do.","😼","Hio","What if I became a spider? Lmao","Makes sense..","Ok, May and August 2019","Well my summer internship availability. But I need the dates.","What else do I include here?","I've been developing games using Roblox since 2008 and began using JavaScript in 2011. Since then, I've been using a variety of languages, including C, C++, Python and Java!","I'm a student at Carleton, pursuing my Bachelor's. I'm in my third year.","Ok so in my about me...","o_o","Oops! My facebook is in there.","So I've got my links set up","I'll leave it for now.","Idk.","Liek something professional.","What would I put for the subject line? If you're looking to email me. It should be something I can see as \"yes, this is from my portfolio\", but not something that's like \"oh, what a nerd!!!\"","Kindaaaa thinking I shouldn't include my Twitter. Idk.","Anyway, this'll be fairly fun to work on.","And I don't think there's much else there. Maybe my resume? Do I want to include that? I'm not sure.","My email, Twitter, Facebook (because they're going to find those anyway, right? Might as well make it easy for them)","And then below my picture, on the bottom-left, just a few links.","For the summer.","Then beside that I'll put my description of who I am: A student, 10 years experience.. And I'm available for internships.","A cat, obviously.","So I'm gonna have one big picture on the top-left, that's just gonna be my pic.","Gonna merge 'em into one single page, because there's not enough for a contact page - what, email? Facebook? Twitter? Not really all that much there.","Aight, so I have my idea for my Contact Page & About Me page.","I pay u obvs.","Who wants to draw me some good stuf","Anyone here a graphic designer?","Guys","(Obviously it won't be good. Because making it good would take a while. But it can be something)","I would liek that.","Like I just plug in the lyrics to say Dare to be Stupid, and BANG, out pops a song about cats.","99% I'm going with my song parody bot, because I would absolutely love to have a bot that writes song parodies.","Also gonna be starting on my AI project.",":/.","Which means, no working on my portfolio site.","It's gonna be fun but it will for sure take a while.","Starting next week I'm gonna be working on my Linux project with integrating a secure folder into Linux's operating systsem.","And I've got a lot of stuff coming up ... :/","(Like I mean, outside of the occasional \"hey, I should work on it!\" I don't do stuff)","I'm not doing much code with it.","Probably won't finish it for a month +, tbh.","How long do you think this'll take?","Again, I'll use other sources / people's portfolios for ideas in terms of that.","Contact page is easy - add my email.","Home page... Idk. I'll figure something out.","On my about me page, I'll probably include a picture of myself (eek!) and details about who I am, schooling, etc.","I want to make it look like the header buttons as much as possible, because that looks the best.","I think the thing I'm noticing, though, is that big boxes are good. Big buttons.","Like I'll rework the layout, etc., so it looks nice.","For the other part, the details, I'll add my stuff for that.","For the main part, I have the layout done, so that's great.","And then when you click on whichever one, it sends you into a page containing the details on that experience.","Each will have the one big box (like Web Apps & Rbx.Lua do here)","I'll have my various work experiences listed, as a sort of \"House of Commons\", \"Open Data Structures\", etc.","So I still need to get my Experience page up. Gonna -probably- follow the projects page layout for this:","My projects page is done. Which means I'm done the code and the layout. Everything's perfect.","Cool. So outside of the icon I'm using for Try 'n Buy, which I absolutely do not like, and the icon for maze game, which, again, I don't like..","Cut my life into pieces.","And this is super hot","I got my Projects page donezo","Guys","This is hot.","Cooool tho","bug","Oof fixed a big","Node JS icon for Web Apps, Roblox icon for Rbx.Lua stuff.","Nice and simple.","","And finalized","Left for Santa Monica.","When you left for Santa Monica.","Nice and simple.","I likeeee it","","Hallejulah.","Not true..","Don't really know, honestly.","But would be worth it","Yeah I'd have to rework my code to work with that","Ooo the cursors","Ty","Oooooo ok","But I mite. I think I'd have to rework a bunch of my code tho so it's iffy if I do it","<@171639959164289024> Yeah maybbb I'm not sure I'm gonna go through with it","George. Of the jungle. That's who I am","I am not a logical race, Anthony.","c:::","And I got a project for today","Ok so I'm gonna go to class. But this looks niceeeeeeee","This looks nice tb.h","Which means, yayayayay","Gonna have to draw some images for the web & Roblox projects 2","i like it tbh","yay!","latest webpage update","","This looks 5000% better o3o","I updated my webpage & now the main project view is all aligned on a grid.","Yay!","Although currently wearing 2 that's a thing","HI SPONGEH","<@171639959164289024> Do u know what the API is for that?","I'm gonna make a thing for getting a player's inventory.","HI FRIENDOOO","Gotta do some dev. What do I do","So guys it's that thing again","WASSUP","HI FRIENDOS","Apparently I'm still second year :(","Oh wtf now I'm mad","Meow!","Lol I don't say woof I say meow","Hi Anthony. Woof.","WHO IS IT? THERE'S NO ANSWER!","Who is it? There's no answer.","HI SPONGEH <@265163518842634242>",":(","I'm singing Melanie! What can the problem be? Sweet Melanie!","Sweet, sweet Melanie! Why won't you go out with me?","I'm singing, Melanie! What can the problem be?!",":(","Melanie!","Now I may be dead, but I still love her!","I couldn't stand it so I jumped out from the sixteenth story window... Right above her.","She wouldn't listen when I promised to be true.","She wasn't impressed when I tattooed her name across my forehead.","How can she ignore me when she knows that K cnat live without her? I have to go through her garbGe just to learn more about her! Melanie!","If she just said the word, In certain that our love would last forever. And ever! Or was she too dumb to realize that?","Is she still mad I gave a mohawk to her cat?","Melanie. What can the problem be? Sweet Melanie.. why won't you go out with me?","She lived across the street on the fifteen floor of the Gilmour building. I saw her I. The shower reaching for some soap. I knew she had to be the girl for me, and to think Inpekbajly never woulda found her if I hadn't bought that telescope, oh...","I've been playing all his songs on loop for sixteen years","U r like the anti me",":o","HI","He said there's not gonna be parodies but I'm excited","AND IT IS SO EXCITING THOSE SONGS ARE ALL BEASTLY AND HE NEVER PLAYS THEM","Weird Al is going to be playing his indulgent tour, where he plays all his most hated songs, in Montreal next Wednesday","WE'RE NOW DOWN TO T - 6 DAYS TO WEIRD AL IN MONTREAL","GUYS","And I don't know how they do it but they should do it good. I sure hope they're doing it for free","Well I don't know where they come from but they sure do come. I hope they're coming for me","HI","Life in the fast lane... Uh huh","Life in the fast lane... EVERYTHING. All the time.","Life in the fast lane... Sure to make u lose ur time.","But I'm too tired to fake it and I'm too tired to fight about it.","Late is bad!!!","Eek it's 9:30 and I'm not even halfway to school yet","HI FRIENDOS","If u get up at 3pm that means u r a wizard","THOMAS","Thanks!","Hi Britney. Remember to bring in a cat the next time you come to my school k? They want cats you see","But I'd really rather just be doing my own stuff yakno? Because my stuff is #fun","But if I don't take one, idk what happens. So it's weirrrdddd","I don't want a co-op is probably the problem. O3O","So I just realized I need to get a co-op for the summer.","Oinkos!","Lol I like","For rocks?","So when u eat KFC, ur actually eating catnip!","In every ten chickens I give to em, I put in some catnip c:","I get em with my #catpowa","I AM THE ONE WHO CATCHES THE CHICKEN FOR KFC","FUN FACT NOT MANY PEOPLE KNOW","Meow iro","I want some pls.","Is it cat food?","*dies*","Oh crap it's a trap","*goes in*","Guys Im going in","COME ON HEEGY!","HEEGLES GETS ONE BUT THE ALMIGHTY EYE DOESN'T???","WHAT","SHE BLINDED >ME< WITH SCIENCE.","HI HEEG","HI CAT","HIO NOT BOB, KEMO, EVERYONE","HI ANTHONY","Bet you guys haven't heard that song in six years.","Oh my god. She BLINDED ME with SCIENCE.","Lmao. Jesus died for ur Vines","He was the goalie for Team Canada when Crosby scored that goal.","https://twitter.com/strombone1/status/969026724431351808?s=19","Luongo continues to be awesome.","(ICYMI, he was the gold medal winning goaltender in the 2010 Olympics. For that goal)","https://twitter.com/strombone1/status/969026724431351808?s=19","Lmao Luongo is awesome","AND HIS AVI IS A CAT","He's Tails but he's icy","HE'S ICY TAILS","","Pls pin that it needs to be pinned <@371377228090572800>","According to Hebrew legend, Noah prayed to God for help protecting all the food he stored on the ark from being eaten by rats. In reply, God made the lion sneeze, and out popped a cat.","<@371377228090572800> Pls pin my last message 🐱","HIO","According to Hebrew legend, Noah prayed to God for help protecting all the food he stored on the ark from being eaten by rats. In reply, God made the lion sneeze, and out popped a cat.","That's not true... That can't be true...","According to Hebrew legend, Noah prayed to God for help protecting all the food he stored on the ark from being eaten by rats. In reply, God made the lion sneeze, and out popped a cat.","Now I kinda want the Hebrews to be right lmao this is great","(also fun is that it was great, he went to sleep, and BANG it was all snow covered lol!!!)","Watch that that's Ottawa","https://youtu.be/57K08WpUaEU","AND I GO THERE LIIE EVERY DAY I TOTALLY COULS HAVE SEEN HIM","AND HE WAS RIGHT DOWN AT THE RIDEAU CENTER","Brent Butt did a podcast of his time when he was in Ottawa","WOW","WE W","BBB","Hello Gump man","I'm sorry","Now I don't want that vDuet","I'm bankrupt and all my money is shipped to communist Russia","But then I'll download it and BAM","You say that now","Keylogging is bad [2]","But it's ok if ur doing it for the lulz","Keylogging is bad","KL","SCAM","Hi Sponge do you enjoy eating @cheese","I really enjoy eating @cheese","Gosh my head is ouchies","But... You die now <@176781771348770817>","Nothing personal.","Hey. So it's business.","Wait what am I talking about again","It was a hostile room.. tough to go into their barn and get the two points.","I didn't do well on my midterm..","Guys","c:","Irl","Meowwwwwwwww","meowwww irl","🍪 I give myself cookie","Now I get cookie?","Ok I accepted both","And tell me ur names","Ok fine everyone send me friend requests","o_o","How'd u get that","IS THAT MY PHONE NUMBER","Hot","OH","Meow irl?","Call pizza pizza. hey hey hey","737-1111","747 too that's pizza","I like that 555","Well I'm sorry Toxic, but I'm not an accountant.","And you're looking for a new one.","But that obviously means your accountant lost you some money BIG TIME and you fired him.","Surprised peopel are still using it!","I know that slang. it's from the 80's.","OH","But don't worry I'm not a cop","I'm onto u <@192731344898359296>","And \"friend me on Roblox\" means \"hook me up\" but in a way that the cops won't get u","o_o","I think it's the new drug","Everyone's talking about \"roblox\" and \"friend me on roblox\"","Rite? It's weird","I still don't know what Roblox is tho","I've taken them with me to the irls","Don't worry I'm not","I do yeah","OH YEAH","Never heard of it.","Ro... blox...?","Roblox? Tf?","TF IS THIS","I've not heard of that game <@!277518874323320832>","WHAT GAME R WE PLAYING","I'LL PLAY WITH U","THOMAS","what's my age again?","cats don't like that.","eeek","but idk why they do it. fun i guess","they do that","is it because of cats?","yes","BUT A SPECIAL HI TO <@!209020511383060491> WE'RE IN A RELATIONSHIP NOW 😻","Hi everyon eelse","Hi Angel","Hi Hasan. Toxic","HI SPONGEH","<@!277518874323320832> Hi George","Hello there George","Go","Lol remember? George lol","Don't even TOUCH my eggos, George.","BYE GUYS HAVE A GOOD WEDNESDAYYYY","YAY","It's a riot. It don't matter.","Like a riot, don't need more guns.","Like a jury, it's a liar.","Line of fire, don't need water.","Cats up the crutch that causes pain.","YO","Twenty five minutes to midtemr guysss","cool it works","k it works now","Still getting from database","Gonna try to crash it again","Ok so I implemented a cache on my featured items because I think that's the issue","I did it again","Ok bye friends have good wednesdays","I like it","Vitoriy!","IT WORKIED","Me","I'm doing it agai","Welp","Did I flood it?","I wonder if it's something I did with Try n' Buy","Restarted it and it's working again o3o","The server stopped working","See this is weird","Anyway. Life is too short to last long","like.. o3o..","And I asked her about and she's talking abou t adiff question","I got two questions on my assignment marked wrong that were right o3o","Rip","😦","😢","did somebody ddos me","olol I think I crashed my server","😢","It don't work","Dang","And I'm testing online if it doesn't work I'm blaming <@164823205855494144>","But now I did","I actually did it yesterday but I didn't update the code","c:","Featured was added into my Try 'n Buy","I did it","Guys","I wish this never ends. I WISH THIS NEVER ENDS","It's now one hour to my midterm #excite","Guys","How'd you get it on ya...?","I smell cologne. Damn, it's strong.","12","9","8","I miss the follwoing numbers: 7","hi i ok","HI","Woah, this is the life.","One thing I can guarantee, the best things in life, they sure ain't free. It's such a thrill just to be me. This is the life!","This is the life.","I got the whole world at my paws and I think it's pretty swell.","They say that money corrupts you, but I can't really tell..","😢","This is the end","Goodbye friends","My laptop nearly dead, that sucks","I liek sno","Snow is always fun.","Yay!","Idk. Anyway I'm good","how","?","/leaderboard","$leaderboard","I don't care about the leaderboard","SPAM IS GOOD FOR THE HEART KEEPS U SPAMMING","Than spend one more minute.. with you.","I'd rather rip my heart out of my rib cage with my bare hands then throw it on the floor and stomp on it 'til I die.","Than spend one more minute with you!","I'd rather dive into a swimming pool filled with double edged razor blades.","Or stick my nostrils together with crazy glue.","Yes I'd rather jump naked on a huge pile of thumb tacks!","Than spend one more minute with you.","I'd rather clean all the bathrooms in Grand Central Station with my tongue.","Shove an ice pick under a toenail, or two.","Rather have my blood sucked out by leeches.","Oh can't you see what I'm trying to say darling, I'd","again and again and again and again and again.","I'd rather slam my fingers in a door.","Than watch you goiung out with other men.","I'd rather rip out my intestines with a fork.","Than spend one more minute with you.","'Cause I'd rather get a hundred thousand paper cuts on my face!","You ain't gonna break my heart in two.","YES","Oh, so honey. Let me help you with that suitcase.","And I have to use the self service pumps!","'Cause I'm stranded all alone in the gas station of love.","You've got me feeling down in the dumps.","I guess I might seem kinda bitter...","Than spend one more minute with you.","'Cause I'd rather spend eternity eating shards of broken glass.","That you found somebody new.","I'm glad. I'm glad!","You ain't gonna see me crying.","That's right. That's right!","Just because it reminds me of you!","And I burned down the mall shop where we used to go.","And I tore all your pictures in two.","So I pulled your name out of my Rollerdex.","'Cause you found a brand new lover. You decided that I'm not your kind.","Gonna leave me far behind. So far behind!","Well I heard that you're leaving... leaving.","Cheez Whiz.","Satan eats ...","NATURE TRAIL TO HELL! NATURE TRAIL TK HELL! NATURE TRAIL TO HELL, IN 3D!","YOU WONT BELIEVE YOUR EYES WHEN YOU SEE NATURE TRAIL TO HELL!","Please don't reveal the secret ending to your friends. Don't spoil the big surprise.","There's a homicidal maniac who finds a cub Scout troop, and he ahcks up two or three in every scene.","The most horrifying film tonhit the screen.","Coming next Wednesday to a theater near you <@215567922758680576>","rude ok bye","Means Weird Al will be in Montreal. :/","You know what that means Amosc?","And in exactly one week it will also be Wednesday, BUT IT WILL BE WEDNESDAY, MARCH 7TH","<@!371377228090572800> GUESS WHAT? IT'S WEDNESDAY","Lol it's Wednesday. lmao","Ok I'm going to Tims bye friends have a Wednesday yeah?","HI SPONGEH <@!265163518842634242>","Oh my Yoda. Yo yo yo yo Yoda.","How he can lift me in the air just by raising his hand...?","Well I'm not dumb but I can't understand","Oh, winded up 21,140 pounds of string.","Oh, what on Earth would make a man decide to do that kinda thing?","I'm gonna see the biggest ball of twine in Minnesota.","I liked the other pic","RUDE","Rude",":(","He's a good cat","I'm gonna apply for that","Which is hypeeeee","Meaning I'd make EVERYTHING for an app.","They're hiring for full stack","Cisco!","And I want a place where I'm actually doing some work","They didn't have much to do most of the time, legit I was just sitting on my phone all day","But idk.","They offered me to go back if I want","It ended in Jan","Used to","c:","Cause this gonna be fun","No but In excited","I'm older than everyone here!!!","Oh yeah no question","Everyone does. Just ask <@267838342836518913>","Jk that was rude. No but srsly you have no idea how many ppl care lol","SCRRW U GET OUTTA MY HOUAR","(which I haven't bothered studying for, but really, who studies these days?)","Got a midterm coming up in three hours","I've gotta actually do that at 4:55 today","In an hour I gotta go prep for my OS project proposal","I got a busy day today which is fun!!!","GUYS","EEEEE","WEIRD AL IS RELEASING A NEW SINGLE","THERE'S A WHOLE NEW MEANING TO TGIF THIS WEEK","OMG GUYS","ANYWAY HI SPONGEH","Oh it went back up","HI SPONGEH","Have some more chicken. Have some more pie. It doesn't matter if it's boiled or fried. Just eat it! Eat it!","Eat it! Eat it! If it's getting cold, reheat it. Have a big dinner. Have a light snack. If you don't like it you can't send it back. Just eat it. Eat it.","Eat it eat it eat it eat it.","Just eat it eat it eat it eat it.","It doesn't matter what you had for lunch.","Have a banana. Have a whole bunch.","💺","Do do do do do.. do do do.","Do do do do do. Do do do do","Do do do do do. Do do do","HI ENVY I ENVY U","U HAVE TO BE NAMED ALABOB2 THO THAT'S THE RULE","BUT U CAN BE MY SON","NO I AM HIS SON","AND THE STANLEY CUP IS IN JUNE I THINK IDK","AND HE GAVE TECH SUPPORT","AND A DUDE ASKED HIM FOR TECH SUPPOET","BILL GATES DID AN AMA YESTERDAY","OH FUN STORY","7 DAYS","IM GOOD HOW U","OH","O.O","THAT'S UR NAME ISNT IT","WHAT","HIO NOT BOB","IT'S ALL ABOUT THE PENTIUMS SPONGE-H","HI SPONGE","7 days","Lmao guys","I should let people know tho because I DO have commitments o3o..","IM SKIPPING TWO DAYS OF SCHOOL TO GO DOWN TO MONTREAL TO SEE WEIRD AL BECAUSE SCREW SCHOOL, WEIRD AL IS COMING.","WEIRD AL. MONTREAL. IT'S GONNA BE LIT.","IN ONE WEEK TOMORROW.","GUYS","O.o","It's about a cat who's a year old and not adopted, thinking he never will be because everyone wants kittens... And then someone adopts him c:","That comic is absolutely wonderful.","https://mangadex.com/manga/23499","I am Bill Gates! Confirmed!","Bill Gates first got started with programming at 13, got his first job at 16 and was really confident with the stuff when he got into college.","BILL GATES USES TABS WHENEVER HE WRITES CODE. TABS!","Heyo Kemo, Anthony, Victoria, Film and friends","THE GATES MAN USES TABS","HE CHOSE TABS.","HE WAS ASKED \"Tabs or spaces?\"","BILL GATES DID AN AMA ON REDDIT.","OH. MY. GOD","I MISS U","Don't waste your time on me. You're already the voice inside my head","THAT'S ME","HI","Yes. 😦","Give me something that I need - satisfaction guaranteed...","I miss you badly, Jumpman. 😦","I wanted all these things that I haven't got.","When I was a kid I thought","Today's my kitty's first ever May","O_O","HI SPONGEO","Does it mean she consents HELP","What does \"no I do not consent to that\" mean???","Guys help","DON'T","Oh, the Jigglypuff is made of glue","Let's unleash and cut the Jigglypuff loose","Bingo!","BRITNEY","🖇","🔗","You linked to my brick wall","Hello Heeg","Hi Mick","Hi toxic","Hello Jim. Liam. ANIVORE. NO LINKS","Ikr","I'M GETTING THAT SHIRT","https://www.instagram.com/p/BftFOawA1rh/","OMG YES","🐈","No I am cat","I need a spatula","Help","Ok bye for real this time","Can't be accessed but support is there. Yay","And featured list is integrated into Try 'n Buy","GOODBYE ALL","And now I can go","Catalog API","https://roblox-catalog-helper.herokuapp.com/catalog?pageNum=160","There we go","oops i'm stupid","c:","But it's a cat","Rn it's jsut Business Cat","My featured list","https://roblox-catalog-helper.herokuapp.com/featured","R u ready","It's now published","And guys","Yessss victories are yummy.","😦","Sry!!!","It's just a catalog api","No <@!277518874323320832>","[\n  {\n    \"Id\": 121389389,\n    \"Name\": \"Business Cat\",\n    \"Price\": 200,\n    \"BestPrice\": null,\n    \"Stock\": 298285,\n    \"Remaining\": null,\n    \"IsLimited\": false,\n    \"IsLimitedUnique\": false\n  }\n]","Ohhh crap the keys aren't capitalized anymore","Featured is completed guys","VICTORY","[\n  {\n    \"name\": \"Business Cat\",\n    \"id\": 121389389,\n    \"price\": 200,\n    \"bestprice\": null,\n    \"stock\": 298285,\n    \"remaining\": null,\n    \"islimited\": false,\n    \"islimitedunique\": false,\n    \"catalog_page_num\": 2,\n    \"featured\": true\n  }\n]","I THINK I GOT IT","GUYS R U READY","FRAQ","WAIT FOR IT","GUYS","Dodle the Percy Pig","I do","Ok","Hi friend","I'm closeee","wow so the code I was basing this off of was wrong","hi frinedos","Shave your shelf.","i have rage","what the frwqawasd","errors","😦 would have been too easy guys!!!","If this works guys featured is implemented","I have success","I did it","And I've got featuered guys!","HI SPONGEY","I got my database working guys","Yayayayaayyay","FRAWQ","THE","WHAT","I don't hate you, pal.","I don't hate you.","c:","It's all in the database now which means I can do ordering, etc.","Yeeeeeeeeeeessssssssssssss","It's only natural. To free the animal. Locked inside","POSTGRES IS WORKING GUYS I GOT IT","HALLEJULAH","You get it, right?","HE INSULTED CATSEYE.","I made this guy stop breathing.","I just made his breathing stop forever more.","It's not fair when they say that I made him die.","I just made sure he could breathe no more.","I swear, I never meant to make him die.","I just don't want him living any more.","He blamed me, but.. It's not fair when he goes and insults the best eye.","Don't insult Catseye, man.","I never felt so alive!","Then I was laughing, lol.","I set fire to his face.","Long story short, he died.","AND HE DIDN'T WANT IT","He had a Catseye","This one guy","Good","Ok","SPONGE","HI SPONE","Or is Catseye included","Did u just insult Catseye?","EXCUSE ME","Ok I'm installing postgres","Yeah, push and shove.","Hear the cheering up above? They always push and shove.","Hey hey hey hey","Ok, so I'm implementing my featured items page. That's gonna be cats c:","Tonight. TONIGHT. I'm on my way. Just set me free. Home sweettt home","But it's a secret k? Don't tell anyone","I'm not a nerd but I do Roblox bcuz secretly I am a nerd","HI LE LOVE","Thx mr. Amx","I could be doing Try n Buy rn","You know what you're right","I'm a killer. I'm a clwon. I'm a priestess gone to town.","Mm2 is for nerds","o3o!","Bcuz it's pretty basic, but u get a bit of everything","How that works","Like go look at lava","Go look up free model scripts","SCRIPTING IS FUN AMX","So I just learned to type fast because if u don't ur a nerd","I've been doing computer 24/7 for like fifteen years","And that's when I need to be doing code because my typing speed is up to like 15000 words per second","And then I go mad","I drink coffee","😦 I want to code but I have nothing to do","The struggle of not having assignments coming up","MEOW IRL","Amx what do I do give me something to do","HI AMX","Hey stoopid.","Nothing tby","But what do I even need rn","I can make mobile apps using Js with Nativescript","Oh shoot that's right eh","I have an hour until my next class","What do I do rn I have nothing to do and I'm bored","Yo help me ou","O_O","There ain't no way you'll lose. Hey hey hey hey. Hey stoopid.","Hey stoopid.","What you trying to do? Hey hey hey hey.","Hey, hey, hey, hey. Hey stoopid.","If you stick a needle in your arm, you'll find the dust. You'll find the farm.","Now I know you've been kicked around. You ain't alone in this ugly town.","Get up that one way trip down lonely street.","That ain't what rock and roll's about.","No doubt, you're stressing out.","You're flying low at a high velocity.","Hey, bro. Take it slow - you ain't livin gin a video.","Hey, bro. Take it slow.","Well I got 33/40 so the system works.","The one I was all \"Yeah, I don't need to study for THAT...\"","I got my midterm back","OH SO GUYS","Woah, woah. Yeah. Bark at the moon.","Hey, yeah! Bark at the moon!","Hey, yeah. Bark at the moon.","Bark at the moon.","Listen, evolve, and he'll hear you.","Look at the beast he's looking for.","Heat burns the second, spewing from the mountains of Hell.","Howling in circles. Living in a loser's spell.","hio'","Ok class bye Heegles have good Tuesday","that SUCKS","I only have 7 zombie cats","Ok so there' slike a class or something going on right? Because it's a Tuesday and Tesday means there's a class because it's not the weekend. The weekend means no class but it's not the weekend so, class.","Tbh, lay it down.","My typing is slow today. Makes me sad. Can't keep up. :(.","All the lonely people. All the lonely people. Where do they all belong?","Looks in the window. Wearing the face of a wig that she keeps in a jar. What is it for?","Picks up the rice in the church where her wedding has been. Lives in a dream.","Eleanor Rigby.","more like meow tbh","meow?","sup","But nice I likey","Aww I only have 411","Meowww irl :(","Link",":o","Yes always","Hockeyyy","HI HEEGPES","Well I have a Simon Steven Stan Hockey Shakespeare William Holly.. etc.","Well which one o3o","Listen to kip he knows things","Ok its place","I think","Rbx.Trade","U gotta go to market","RbxRocks don't do that",":(","CAN I KILL U FOR UR INSOLENCE <@204503807667863552>","RUDE",":o","Jk the original was good but melee >","Original >!","Ppl r hacking the Sweeetch and I think they're getting close to something","THE HACKS","OH","That'd be hype","They're gonna add it eventually rite o.o","Ooo yes Stadium","That'd be freaking hypes","Imagine Paper Mario TTYD on that","NOT YET BUT IT'S COMINF BCUZ IT HAS TO RIGHT???","THEY'RE GONNA GET VC SUPPORT","Is already like a super amazing console","With Odyssey and BotW","The Sweeetch right now","Get a Sweeetch >>>>","Rip :(","HOT","THE SWITCH ONE?","OOO THEY'RE ANNOUNCING IT?","I'd just say \"I use Charizard! Rawr!\" And fly around","Albeit I never knew how to ACTUALLLY play the card game","I used to love tournies for the card game","Oooo tourneys","Is there anything special happening?","What are they doing for Poekmans day","POKEMANSZSS","OU SHOOT IT'S POKEMON DAY","I like it!","Get drunk and then take bunnies from the hat and throw them at people","Ooo!!","I should just go to class with a whole herd of bunnies","But then what do I do with the bunny","🐰","I reacted by sending them a bunny","GUYS MY SCHOOL IS HANDING OUT FREE BEER TODAY","Meow!","Especially <@390978362920665088> .","Hi friendos. I have heard of your struggles and just want you to know that I will forever be your hat.","Its like ur saying hi all cool-like","In Japanese coffee is coohii","Guys","But then I did because yolo","So I didn't get coffee","I wanted coffee today rite but I was running late","So guys","Don't do that. Eeeeek","http://metro.co.uk/2016/09/29/boy-11-pinned-down-and-had-bleach-poured-in-his-eyes-by-other-school-children-6159380/","Now I'm leaving bye","OMG RUDE","+ 10 to belly","That's the L2K Specialty Sandwich. Tastes ultra yummy","Ok 🥙","Julian want a sandwich","Ur Isaiah? From My Littlest Pet Shop","I HAVE THE POWERRRRRRRRR","ADD ME AS MOD","Oh, fun fact, if you block out the sun you become Mr. Burns","Ok thx u that is my note of the day","LOSER","BUT UR NOT 18 UR 18 AND A HALF","I'm 18, I just don't know what I want.","And I don't know what I want.","But older peeps, they don't do the halfs! They only say I'm 18.","They told me, young kids, they all go \"I'm 5 AND A HALF.\"","You know there's a story. Told to me millions of years ago by my grandest of elders.","And a HALF","I'm only like 53","Toxic is 2Toxic4Irl","No, Toxic is the anti Toxic.","NITE TOXIC","And I will meow at you incessantly. That will teach you your lesson.","If you should look at any other black cats, or if you should find another Percy Jackson, I will find you.","As such, I will issue each of you a warning.","It's time to say goodbye.","I think","Guys","I have not tried that. I'm not really interested either I'll take your word for it","I like cheese","You know fun story","FILM","Every George. Every George is magic.","Hi Oof. Or should I say Georgie","Guys I don't know you but I know your child, George. He's my best friend, I guess you could say, except he's only six years old and I'm thirty five. Lol. So there's a bit of an issue there. But it's alright we're very good friends. Even ask George! Lol, I'm not creepy","😦","I miss youuuuu","I miss you. Miss you. Miss you. Miss you.","They kinda suck, sure, but that's good stuff","Petr Mrazek shut out the Habs","Wowzers","Don't waste your time on me. You're already the voice inside my head. I MISS YOU","And there's a bunch of questions on definitions, but I'm more than good enough with those imo.","So I have a midterm on Wednesday. It's on databases. I know all the relational algebra stuff (because it's algebra. I love algebra)","I know this weird guy, he doesn't love cheetos. O_o","True story.","I love cheetos.","c:","And it loads the stuff into the browser","I made a very simple web server based off my AI project","Bu","So I'm not gonna finish this up because it's a whole bunch of cookie & database stuff","Ok guys","Meow irl?","I need to read cookies & stuff, but for the most part, I have victory.","And I am VICTORIOUS","I did it","Fyi, guys","Cant wait to see my muh-fin!!!","Like Alfie who is Alfred's son","U can remember it because he is Karl's Son","Karlsson","u did it rige","KARL BARL","That's my friend Alan guys","","ME IRL","O.O","O.o","Thomas. Remember what I told you.","Ok, looking.","I know that you're probably sore cause I didn't write any more - I just didn't get to complete it, so that's why I gotta repeat it.","HI SPONGE","Do it right, Hasan","Hasan do it","And the process continues until at some point, something happens (this never happens).","Then, once you have the code written, you must write the code.","The secret to coding is to first write the code.","We're up all night to get lucky. Hey!","U get to write code","CODING IS THE BEST","This is super awesome.","Ok rant over","I love Dorion but his inability to commit to things makes me sad. KEEP KARLSSON U NOOB","U have to watch hockey","HE HAS TO BE HERE IN JULY AND HE STILL WON'T COMMIT","Dorion is Sens GM","\"We're going to make him an offer if he's still here July 1st.\"","Dorion, being typical Dorion, talked to media:","Karl is staying in Ottawa, meaning he's here until AT LEAST the summer.","WOW GUYS","KARL IS STAYINGGGGG","GUYS","HI TOKYO","Who needs a harp when a harp can be broken?","Now Norman's a billionaire scientist who never had time for his son. But then something went screwy, and before you knew, he was trying to kill everyone.","YES IT IS OMG","HI KEM","If you missed it don't worry. Them say the line. Again Anne again and agaib","With great power comes great responsibility.. that's the catch phrase of old uncle Ben.","Now Harry the rich Kidston a friend of his who horns it on Mary Jane. But to his great surprise it seems she prefers guys who can kiss upside down in the rain.","HI DEVF","Sling us a web, you're the spiderman. Sling us a web tonight. Cause we're all I. The mood for a hero now. And there's evildoers to fight.","Poor Peter Parker was pitiful. Couldn't have been any shier. Mary Jane still wouldn't notice him even if his hair was on fire. But then one day he went to the science lab. That mutated spider came down. Oh and now Peter crawls over everyone's walls and he's swingning all over town.","That feeling deep within. Its just beneath the skin. I must confess that I feel like a rainbow.","Lmao.","Macho juice?","Ice cubes?","I'm gonna go to Tims. What do I get? Lemonade?","We're now at around one hour left. This is the big time for Karl. Still three teams talking.","So guys","Which is good for me","I did my assignment presentation and got 98% apparently","So guys","<@277518874323320832> That's Simon. Lol get it? Simon's Cat.... Simon is cat.","Is me. Credit <@401038095476326401>","","Hi Icy","Luckily for my clipboard, Oduya got claimed.","Haha, Oduya's bonuses are ridiculous. He gets $250K each time he\n1) plays 41 games (Sens paid)\n2) plays 65 games (needs 14 more)\n3) Top 5 TOI for d-men\n4) Top 3 TOI for d-men\n5) Qualifies for PO's\nSo a team would at least be on the hook for $500K assuming he played in 14 more gms","Weird. I copied my avatar and it gave me some info on Oduya. I agree entirely with it tho:","More Olympics themed","And I'm not even Easter themed","I am the best Easter themed Roblox player","Yeah","Only one hour left tho. LOOKS LIKE we're keeping Karl. Pls Mr. Dorion.","It'd be fair to say screw the assignment and go hide imo.","Imagine if Karlsson gets traded in the next five minutes?","Isn't it EXCITING","Guys I have my assignment to present in ten minutes","Yay!","And a grammar Nazi.","Wow I got me a hater!!!","Yo.","u guys cray.","WITH FAKE ID","why the heck can some random dude go into a gun shop and pick up an ak47 in five minutes","\"No, we need MORE guns!!!\"","U guys r so messed up","c:","& a scoreboard","I added controls","simple-maze-game.herokuapp.com","Ok updated","I have an hour guys.","Oof!","I mean, yes. That's mine.","YES THOMAS ISN'T TAKING CREDIT!!!","Or did I make that? I think I made that","Did u make that Thomas","O_O","I LIKE IT","Keboard-san","Beautiful.","Almighty.","Crimson.","I'm Catseye.","I'm not Adurite.","Adurite?","ok makes sense","Ohhhh so it just means \"Filler Text\"","o3o3o3o","But I doubt that's what it is","And if my objective is to prove carrots are enhanced developers, I love it","It's supposed to be my project objective","Which I like but I doubt that's what it actually means o3o","Google Translate says its Lorem ipsum carrots, enhanced undergraduate developer, but they do","What does that mean","Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do","Does anyone know Latin","I had a coffee and I half want to write some code while I half want to do nothing. What do","That's my life philosophy.","DESR","\"RAWRRRRRRRR\"","Say","Ever","Don't","Screwwww the Pens they suck","Never like to see a guy injured but I would love to see the Penguins get eliminated because they don't have Murray.","Matt Murray might be injured.","Oooo dang","If Karlsson gets traded, I'm going to blow everything up. Boom goes the dynamite.","IT IS NOW \"LESS LIKELY\" THAT KARLSSON IS TRADED","YES","Because scam","❤","HIIII SPONGEEEE","😦","DON'T EWW ME","That is ultra cat","Because scam","Hi Icytails","THAT GOOD CAT","Cat goes meow","YES","CAT","o_o","And minutes later one of thier big guys is dead","Winnipeg makes a trade for Stastny and looks super duper stronk","Imagine that","I hope he's ok","He looked ok thoooo","ENSTROM GOT INJURED","OH NO","THEY ARE OP","THE JETS TOOK PAUL STASTNY FROM THE BLUES","GUYS","🐨","well if he's a koala bear, then he's my BEST friend!","he told me he wasn't.","oh he is?","There's a bunch of trades going through. Every one is terrifying because they might be Karl :(","UGH TRADE CENTER","I remember being the Jr high school princess. Lmao that was a while bacm","Anyway the wind anyway the wind anyway the wind blows. Hey!","Nothing matters! Nothing matters! Nothing matters!","Nothing really matters.. nothing really matters to me.","Nothing really matters... Anyone can see.","Sent shivers down my spine. Body's aching all the time. Goodbye Vienna. I've gotta go.","Too late! My time has come.","Mama! Just killed a man. Put my gun against his head. Pulled my trigger, now he's dead!","I'm gonna reschedule. Ask em if this is real life, or is this a fantasy? I'm caught in a landslide.. no escape from reality.","<@385679063026761728> It's ok. I had an appointment scheduled for today but I called in sick today","I'm on fire, baby! I'm alive! I'm alive! Can you hear me, Discord? I'M ALIVE!","I can do anything I want to - I am invincible now!","Calling in sick today.","Ain't going to work. No way ...","Calling in sick today ..","I'm calling in sick today.","Hey.. hey.. hey.","I think I'm missing a contact lens... I think my wallets gone..???","I mean, I'm really such a groovy guy.","Oh well, she told me she's leaving me for good and all I want to know is why...","When I leave a room, first, I gotta grease the door.","Agreed. I'm gonna tell them that.","They called me because I know hockey. I'm their expert...","They want to know what to do.","It's Karlsson for Stamkos, one for one.","They're telling me they've got an offer on Karlsson.","Its the Canadian Tire Center - the Senators.","Holy crap, guys.","I'm getting phone calls...","Did you tip somebody off???","Guys what the hell","What the... Heck","Stop hacking me","Little did they know I was actually giving them Hyland Goldfish","Everyone would come to me to get their fix","Lmao I remember when I was the master of weed","Don't forget Judi Dench. He's my good friend but he's not a koala bear :(","I am not wrong","I answered George Takei","I had a test on Japanese","Hi spongeh","Not \"George Takei, eh?\"","Takai desu ne means \"it's expensive, isn't it?\"","What's a pediatrician","Yooo","So let your colours show. We love it if u let urself go","And we won't go home, until the morning glows.","Early in the evening. And the sun's set low. I'm calling everybody. Everybody I know","I can't dance without u tho","Oof it just got loud Hungry Hungry Hippos <@335097435896414208>","COCO MY OREOSSSS","Give my kittens back to u","U give me tonight, I'll","I'll tell u nothing but the truth","I tell you no lies","I can't dNce with brick walls","MEOW IRL","<:wiggles:339591589594660864>","hm","WHO WANTS A CAT <:wiggles:339591589594660864>","HI FRIENDOS","That's gooddddd stuff","Elvis Presley's daughter managed to reduce her wealth from $100 million in 1995 to now only $14k","Lmao","And today I go to the game to cheer for Karl's last game as a Senator 😢","So anyway #MelnykOut","Methot hates him.. Turris hates him.. Karl hates him.. EVERYONE HATES HIM","(The only reason Karlsson wants to leave is Melnyk. Their former players have gone on record saying the guy is insane and killing the team...)","(And even the team hates Melnyk!)","Because the fans absolutely hate Melnyk","And he got the $5k in under a day","And a guy went on GoFundMe to get $5k to pay for a big billboard ad of #MelnykOut outside the CTC","And now they're advertising it","So there's been petitions of #MelnykOut for like five months","It's all about money and the guy is a freaking billionaire like come on u idgit","And the fans hit the last straw with Melnyk","The Ottawa Senators are trading their best player ever (Erik Karlsson)","Ok so story:","COME TO MY WORLD <#303863730176000001> FOR A STORY","OH FUN STORY","Today's the Macy's Day Parade, http..","But the best is mine.","Prepare for the best.","Http THeo","EVERYTHING'S Magic.","Everything.","Hi Dodl","HI THOMASSS","HI AMX","Don't crawl into your shell. That's not where the world is","Blobster are you serious","Hello there. The angel from my nightmare. The shadow in the background of the morgue..","I miss u.","But...","I love u Blobster, Toxic, Victoria..","I love u Spongeo","I love you Cloudbrake","😦 I miss u","So I'm going to Karl's last game as a Senator today #ripkarl","Don'tttt Talkkkkk Abouttttt Koalas.","meowwww-irl","Lmao, you ever seen someone come into your house just to say \"goop\"? What's up with that?","But oof","WE MADE THE CUP LAST SEASON AND TRADED OUR FIRST ROUNDER COME ON DORION","Trade everyone and start over.","And Ottawa gonna rebuild.","HI SPONGE","Ottawa trading Karlsson","It's official now","Dang guys.","o-O","Does RbxForums even have a Scripters forum","Yo <@!171639959164289024>","Ok. Drama:stop ()","Magic. Idk. Blame the hippies.","So you'd end up with both...???","But happy that I'm being nice","U'd feel angry that I'm being rude","But it'd be weird wouldn't it???","But I guess same could happen with both","Whatever","Just kinda","You don't feel better or worse after having talked to me","Indifferent","I'm kinda like","More of neither","HI ME MR GAY","And for the record, I'm not nice but I'm also not rude!","Thank you <@333360948838531072> .","Do not EVER try to tell me that the number 16 is larger than the number 12. It's not. It never will be. That is nothing but lies and slander. And I would appreciate you never telling those things EVER. AGAIN.","SPNOGEEEEEEEEEEEEEEOOOOOOOOOOOOOOOOOO","CONFIRMED","<@333360948838531072> U R NOT NICE","Guys. Not to be that guy (I usually am that guy, for the record) but giving the middle finger to the cat is not nice.","Alrighty so let's go BAKURA","c;","Redesigns are fun though.","Alright so I have the pug redesigned and it's working sorttt offff but I'm gonna need a major overhaul of the CSS and pretty much everything o3o.","Adds an extra click, thoo...","So I'm thinking I do something with various images on each page which lead into the page you want.","Add to the JSON and bam it's there","{\n    \"selected\": false,\n    \"text\": \"About Me\",\n    \"id\": \"menu-about\",\n    \"href\": \"/about\",\n    \"templateName\": \"aboutMe\",\n    \"title\": \"About Me\"\n  },","Added an \"About Me\" tab. It's crazy how simple that was c:","Just basically for content ofc.","http://pgiwarries.wixsite.com/phoebewarries","So there's another webpage I found which is absolutely amazing imo and I'm gonna use it for examples of what I shoiuld do","Meow irl","Heeg","You get a cookie 🍪","That's correct!","Between 1 and 6. Pick,.","I'm gonna decide on a number.","Really went downhill when they removed the forums.","LMaD used to be such a great place!","<@223243176641691649> 🔫","The first tribute has been decided.","Will must die now.","MEOW!","Meow meow!","Meow irL!","c:","My world is filled with meows","Meow irl","Pls decide ur first tribute","The amount of people allowed to live will decrease by 1 every hour for the next six hours","I've just decided","Guys","😦","meow irl","Obviously","Me","\"UR STUPID\" - Donald Trump","And tell him","I'm going to mail a letter to Mr. North Koreo","It's time to end the world","Guys I have decided","😦","RKB","Hi RKNB","NO UUUU","But we can be bored together!","Me too Tokyo.","I'd like that.","Hmm.","Be brave for me, Dodle. Ignore their eyes. Just try!","Find me. I'm waiting right here where you left me.","I feel like the ninja wouldn't be very nutritious for them.","Is that healthy..?","Hmm.","We need two!","But I have 500 cats!","Unless the cats can play with the ninja.. I guess that could work","But then if I give that to the ninja, what about my cats?","OHHHH","We don't have alligators here.","Well I guess you can do that, eh","Ohhhhhhhhhhhhhhhhhhhhhh","How do you even deal with them???","I guess I just joined the club then <@!277518874323320832>","HI SPONGEO","Just happened to me a few hours ago and oh my god, those guys are terrible!","Have you ever had a ninja take down your entire city's power system?","I got an exam Monday yay!!!","I now know my hiragana well enough again o3o","I'm through the first six pages of Japanese homeaork","Ok guys","And now you're messig with a son of a bitch","DON'T DO THAT","ANIVORE UR MESSING WITH UNCOMFORTABLE SILENCE","Rip doggo :(","Rip them doggos :(","When you come back home, you'll be a lot closer to done.","Fill it up with things","Go to the store and purchase a landfill.","Want time to pass more quickly?","Greenu","Nom nom nom","INCOMING FISHHHHHHHH","Brotha's not a game as far as I know but alright","I do I do!","Used to be alive... And then.. just, one day, he wasn't anymore.",":( rip Jim.","I miss you, Jim.. so much.","If you want me take my pack","The world comes crashing down when she comes around.","My bees r nice and cuddly","EXCUSE ME","HI REAIZ","<@340318503368261632> Bet ull think twice next time you try to leave me alone with the bees :(","If you see it, you're infected","It's a virus","It's not real lol","She takes my world and turns it up. Turns it up. Turns it up.","But the world comes crashing down when she comes around. Sets it on fire!","I lose my mind with the way she moves 😻","I wish my girlfriend was more like you.","Yo, Oof","Goodbye George. Have a Free Wednesday","Also my friend","He's my friend's friend's friend","DON'T FORGET ABOUT <@312615945270984704>","Meow_irl","I wish","One robucc.","https://i.pinimg.com/originals/89/48/68/89486884cf60148a11046b9a056baffe.jpg","Alright. One robucc coming up.","He's your dad now  <@223243176641691649>","👱","Alright. One dad, coming up.","Yo. The fruq?","Anthony. Don't even joke about that","OH MY GOD THEY TOOK IT ALL","Wtf.","Seriously.","Stop. Touching. My. Mayonnaise.","DO NOT TOUCH THE MAYONNAISE. WTF?","Goodbye. Shedletsky over and out.","Well tell him Shedletsky sends his condolences.","Oh, your friend.","Then it's over for you, sorry LordDrakulus.","o-o","Email info@roblox.com. Tell them Shedletsky sent you.","Ohhhhhhhhhhhhhhhhh that's not my department","<@294940290354118656> Sup! I am the one known as Shedletsky.","Rip me. I am ended","It's all that I wanted.","Now I know..","That'll be ODer Kingdom","Everything. Everything's magic","borrrrinnngggg","lmao","*Parties*","*Builds house*","They're always messing all my plans up... Ugh.","I always forget about the ODers.","Oh, crap.","How???","You got past my keylog filter...?","Jumpman, wtf?","No more keylogging...","I've implemented a keylog-protection policy","Sorry, they were all keylogs.","HI HUNGRY I'M PERCY","I miss you.","I miss you 😦","I miss you.","Don't waste your time on me, you're already the voice inside my head - I miss you, miss you.","Don't waste your time on me, you're already the voice inside my head - I miss you.","I miss you Http Theo","*sets darkness in the valley*","Hello there.","I missed you..","*opens door*","Irl.","Meow.","*shuts door on jumpman's face*","YOU SHUT.","I want to talk about me, I want to talk about I, I want to talk about number one on the west side.","Hey, look, ok? It's great talking about you and all but occasionally","Its not me. That's all I know","Thank you for being my fan.","Let's have a party.","I lift u up","I love you Mr. Toxica","Hello ZUCCHINI","Du hast mich gefragt.","Du hast mich.","Du hast.","Du, Dodle.","Me on my way to you!","If your body matches what your eyes can do, you'll probably move right through","I wanna make you booze because you stand and stare.","Thx!","I am not Baheeg. Thx tho","HI SPONGEH","IM GONNA GET MY OREOSSSS","SAMSUNG'S ROLLING OUT OREO AGAIN","GUYS","Oh it's what you do to me.","Oh, it's what you do to me.","On TSN","Its tonight at 7:30","<@265267593085059072> Sens vs Lightning","c:","See there's blocks and stuff","Yeah me irl","There's a game tonight at 7:30 <@265267593085059072>","All that glitters is good.","xd","Lmao jk I'm Percy. Can't believe you fell for that","Hi friends. I am George","HI SPONGEH","Magic","I miss u.","That's my password","CLUCK IRL","OMG","Meow irl kind of cat","I'm no chicken I'm a little cat","Me?","In Romanji","What's ur name  <@391776533225668628>","<@391776533225668628>","Gichihukaru?no?","No thTs a lie","I'm forgiving what I've done.","And wahtever things may ocme; today this ends","For what I've done... I start again.","WHAT I'VE DONEEEE","AND WASH AWAY","SO LET MERCY COME","OF UNCERTAINTY","WITH THE HANDS","WELL I CLEAN THE SLATE","WHAT U THOUGHT OF ME","wHAT U'VE ASKED","HIO SPONGEO","But I can't publish this thing until I Do","I have to write about my work experience and I have absolutely no idea how I want to format it","Dang it","Got five for now","Gonna ideally work on some more and add them in there but anyway","And there we go, that's all the projects I have saved.","https://simple-side-scroller.herokuapp.com/","Mk, so I added a hack-a-thon project to it. My side scroller c:","And there's blocks in the sky","It does asolutely nothing BUT U CAN MOVE","MARVEL AT THE SIMPLICITY","https://simple-side-scroller.herokuapp.com/","guysss","RIGHT HERE. RIGHT HERE","Urgh.","Like I don't want something crazy I just want basic stuff o3o","I hate how I'm trying to look for examples and it's all these people that have gone with crazy webpages for their stuff..","Hm","Erm","Various duties I was doing (eg. what kind of technologies)","So for any workplace, I have...","What kind of info do I want on it?","But I'm kinda lost on desing.","So I'm working on Work Experience now because the Projects page is hot enough","And what do I want to represent with it","So what all do I have for work experience guys","Arrow keys to walk around get the m to the x eh","My game is fun fyi","https://simple-maze-game.herokuapp.com/","I just hate how it sounds.","Yeah I guess I know","Just for one thing.","If I traded it all, if I gave it all away - for one thing.","Across a line","You should be mine","c:","hi friendos","hi toxic","ur my friendos","hawt amirite","looky at dat","","hi friendos","Eh, it looks alright.","What should I do to make the headings stand out","- Item 4","HEADING","- Item 3","- Item 2","- Item 1","HEADING","If I have a thing","Guys","Yo","Yeah alright sounds like it's worth doing","etc","- Try n Buy","- The Maze Game","Games","- Advent of Code 2017","- Open Data Structures","Webpages","I might add some headings in here...","Updated my Projects page. Now has support for Roblox games.","There we go","They'll think I'm insane. But they'll all know my name.","I'll take all the blame. The front page and the game.","Red Button and I'm loco.","Don't make me. Cause I'll do it.","I've been dead. So many times, I've lost count.","Rejected. Since day one. My name is. Bastard son...","Lighting up my eyed","And I know you see me breathing","I have the autists","Me too","Now your kitten says hello.","Ooo. I'm your fucking kitten.","Right?? Absolutely amazing!!!","But I do it in a heavy metal style","I am a good singer and I sing about cats","Thomas listen to me","Sad irl!","Dang guys I just missed my bus","Ok seriously tho bye","Nerd","o_O","LMAO","Ok I'm going to school bye guys see ya next week","I am the embodiment of extreme respec.","Me.","That'd be my assumption","Probably six right","What do you bet is the number of pegs on the board right now?","Guys","DOUBLE RUE","$ban <@127874832351232000>","OMG RUDE","No but seriously you're banned for the rest of eternity goodbye","Just kidding","Rude.","But I guess that's why you're the linguist in the family lmao","I honestly do not know why you would say the word \"Cobra\" without preceding it by the word \"King\"","Guys","Oof!","So many updates","And yeah good stuff","Link to it","Gonna take a pic of my Try 'n Buy now, upload that to my website as another project","Just like a young girl should","BROWN SUGAR","How come u taste so good","BROWN SUGAR","so yeah I'm good good stuff","AI is done","And Japanese","And then the AI assigmnet","Got the pres done yesterday (for the most part)","Yep","Which I think means I'm done with everything except Japanese?","Ok so I finished up my AI assignment","Ofc","U look like my friend George","The pic","It's because he's SPONGE!!!!!!!!!!!!!!!!!!!!!!!","Whered u get that o3o <@!320487777559117825>","HIO","Did u draw that","It's very good. Very catto.","I LOVE IT BLOCKSO","FOR THE VERY LAST TIME","I can hear your heartbeat","Oooo baby, yeah.","Ok good","How well do the searches work if you increase the size of the board? => With 3x3, there'd be a few more possibilities to check, but ti wouldn't cause a big difference. With 5x5, it would likely run out of memory very quickly or take a very long running time to find a solution.","Does the combinatino work better or worse? => Worse. There's a large speed dropoff.","Why did you choose these heuristics? In order for the game to progress, there must be jumpable pegs. The heuristics count the number of possibilities, so more possibilities == better chance of leading to a win.","Which heuristics did you use? 1 - Number of pegs with no surrounding pegs; 2 - Number of pegs which cannot be jumped","HIO","That's one of DFS or A* - they both worked quickly & came to the optimal solution.","Which search worked best?","I'm done my AI assignment","Ok yay","that cat so freaked out","especially that cat","yes hot","oooo dang hot","You're on TMZ","You're on TMZ.","They're on TMZ!","They're on TMZ.","Look who's drinking... COFFEE","OF LEAVING THE HOUSE WHILE FAT","I pronounce her guilty.","*gives nickel*","Ok fine I give u a nickel in spirit","U have no coin emojis?!?!","R U SRS DISCORD","But like have a nicek","So I don't really need a guinea pig because that's different things","Cool","There's a free nickel in it for you","😦","Ok so it's homework time. Who wants to be my guinea pig","She's gonna be ok.","u got scammed","rip!!!!","Yeah, we got our black ops all over the world (from Pakistan to Bombei)","I'll assassinate him later.","I've done a couple of crazy things that have almost gotten me dismissed - like terminate some head of state who wasn't even on my list.","It's a party in the CIA.","Yeah.","For an undercover mission..","I'm feeling nervous but I'm really kinda wishing","Ciggies much","Tf?","But I am NOT Will!","But if you prefer, you can call me Percy. I'll accept that too.","Pls Block. Call me Wiggles.","I know you said Will.. That's why you said the wrong name, because it's not Will. It's WIGGLES.","AGAIN I AM NOT WILL, I AM WIGGLES.","I understand the confusion though","#GETITRIGHT","I AM NOT WILL I AM WIGGLES","He left his home and kissed his mommy goodbye, saying someday I'm gonna be a Jedi. Someday I'm gonna be a Jedi.","Oh my my, this here Anakin guy. Maybe Vader someday later, now he's just a small fry.","That's where we found this boy.","We took a bongo from the scene and went to Theed to see the queen...","We escaped from that gas, and met Jar Jar and Boss Nass.","But their response, it didn't thrill us. They locked the doors and tried to kill us.","To maybe, cutting them a little slack?","Could talk the federation in","And I thought me and Qui-Gonn Jin","Naboo was under an attack.","In a galaxy far far away","Once upon a time","i phone him up at home and make him do my tech support IT'S ALL ABOUT THE WIGGLER WHAT WHAT WHAT WHAT WHAT","i'm down with bill gates, call him money for short.","i'm strictly plug and play. i ain't afraid of L2K.","installed a T1 line in my house.","i never feed trolls and i don't read spam.","RIP ME","uh huh, yeah.","oh.","oh. uh huh, yeah.","it's all about the wiggler baby","confirmed","so if you've got some idea... didn't think so. well i'll see ya","what's the message, i'm conveying? can you tell me, what i'm saying?","but i don't know what i'm saying.","and i'm playing","well i'm yelling","5819","ok","do you want the numbers on the back too???","149105 1940 1095 104","ohhh ok","my password is wiggles_irl","oh ok","but u just did a $keylog @wiggles","u say that now","why r u keylogging me andy","is that a keylog","what dat do","o_o","I'm so loud and... incoherent. My name's Wiggles. F*** ur parents. Yay","I just don't know what I'm saying.","o3o3o3oo33o","I don't even care about the leaderboard","O3O","$ban <@!297582967059120131>","Every sentence I write is meaningful. Has meaning.","You of all people should know that by now","I DO NOT SPAM ANDY","DIDN'T EVEN PURR","Had a tiny little scratch on my toe","Once I fell off the eiffel tower and I barely even stubbed my toe.","I could eat more frozen waffles than any other man you know.","I think","Where is?","Dore is for asking, I think?","Ano nooto wa ____ desu","Ano","Are","it's a","Omg it's not do","Nooto is notebook","Is that right blocks","Dono nooto wa ____ desu.","Dono: The thing over there","Sono: Your","Kono: My","Kono, Sono, Dono","Dore: That thing over there","Sore: That","Kore: This","Kore, Sore, Dore.","The rye or the kaiser <@!163719236982800384> .","The rye or the kaiser.","Or the kaiser.","You can have your roast beef on the rye!","If you want substitutinos, I won't put up a fight.","Let me please be your catering advisor.","It's the rye or the kaiser. It's the thrill of one bite.","All the while, you can still hear him say.","Goes in the back and beats up on the liver whurst.","Steady dreams of his past days of glory.","So today, his deli comes first.","Or the kaiser.","But you can't just go wrong with the rye!","Stay away from the tuna. It smells funny tonight.","I never eat while on the job - I haerd it's good to stay hungry.","Oh, don't download this song.","Go and buy the CD, like you know that you should.","Don't go pirating music all day long.","Don't donwload this song <@277518874323320832>","Hi <@265163518842634242>","Hi friendos","The record stores where you belong...","Don't download this song.","But oh well it's obvious I'm white and nerdy.","I wanna roll with, the gangsters.","Holy cow. I'm white and nerdy!","Yeah I guess I'm white and nerdy","Think I'm just too white and nerdy?","What's up Sirleavitt","And he ended up, in one week, creating his own Nazi Germany.","Ran an experiment!","Teaching about Nazi Germany","Teacher in the 1960s","https://www.reddit.com/r/todayilearned/comments/7zbf0j/til_because_he_felt_his_students_couldnt_properly/?utm_source=reddit-android","INTERESYING THINGAMAJIGGLE","But I think so o3o","Idk if he'd even accept it tho that's natural language generation","I've gotta make an AI and I might make that because yolo","Canada goes meow !!!","CANADA TAKES THE LEAD","GUYS","https://twitter.com/SensProspects/status/966520618781954049","Ok watch this video","WARNING: BAD WORDS","ARE YOU F***ING KIDDING ME","Lmao they gifd it","Lmaooo watch thaf","Check out @SensProspects’s Tweet: https://twitter.com/SensProspects/status/966520618781954049?s=09","#GO CANADA GO","AGAINST THE USA","GOLD MEDAL GAME","IT'S TEAM CANADA GAME TIME","GUYS","Yay! That's a + for laziness. I don't even have to get up.","The game is on the same channel!","Well that was fun now it's gold medal game time","Ok Sens lose","USE KARLSSON YA IDGIT","How long will we go??? Pyatt!","They've now gone to the seventh round of the shootout, because there is no watching that game.","There's the gold medal game for Team Canada","Urgh.","Like the arena was going, not super loud but loud, and it was still wayyy louder than anything.","AND IT WAS LOUD.","AND HE SCREAMED \"ARE YOU F***ING KIDDING ME\"","He was mad","No penalty","Karl got slashed","Ottawa in 3 on 3 OT","Lol that was amazing","ok bye","THX U","SEND UR EMAILS","PLS TELL THEM NOT TO","OTTAWA IS SHOPPING KARLSSON","GUYS","AND DON'T TRADE KARL","OH","go sens go","remember","ok i go bye all","o3o","almost 3 - 1","andddd","chicago already scored to make it 2 - 1","i'd better go","SEEMS LIKE A KEYLOG <@!270656969835151362>","rip poser","tokyo u want to show redd how it's done","HI KEMO","HI TOKYO","it's \"doing the nasty\"","it","it's not \"making out\"","redd","WTF?","IT'S 2 - 1 CHICAGO?","ARE YOU SERIOUS","THE FUC","WHAT","i am","yeah","lmao!!!","that's probably 'cause ur channel is garbage","u must be doge","rude doggo","ESPECIALLY BY A DOGGO","i don't like being recorded","i'd better go.","you're recording this?","wait","NOOOOOOOOOOOOOOOOOOOOOO","NOOOOOOOO","oh my god.","???","are you telling me","wait","but it's just ...","i was worried it was a !!!","oooo ok","<@333360948838531072> are you serious","lmao","you have a sick mind","lol, wtf?","Lmao I just googled that and","GOOGLES","Arrow keys to move & u want to get to the X from the M.","Prettyyy funnn!","https://simple-maze-game.herokuapp.com","So if ur on a comp (only works with a keyboard) & you want to waste some time","I set up a server for it","Oh btw","","OK THIS WILL BE MY LIFE MOTTO FROM NOW ON","Baheeg can u buy me a monkey","Be that somebody.","Somebody has to ignore the facts.","All you need in order to make a movie is pain","[hi","An apple a day keeps the army away","!!","And freak em out","Then go walk around places and stare at ppl","I can get a shirt with \"You are about to turn into a duckling.\" written on it","lmao","Having ur tits cut off is a shock.","","meowwww irl","","What's unfunny about paying a guy to be a fly?","","Me irl","<@344169540281696259> The fact that you are pure, is what makes you ok.","Without potential, there can be no magic.","Travel is to refuse to be dead.","❤","HI SPONGE","Underrated.","A mental breakdown is like a rollercoaster ride.","","True fact tbh","Home page still no idea","Contact still no idea","So HoC, list what I did, etc., TAs, summer etc","Except instead of listing projects, I'll be listing work I've done.","Actually, the experience I've got a good idea on. Same style as I have for Projects.","o3o","So","But gotta write a report","I know what I want to do for it (either my poem bot or just a bot that'll write sentences)","Well there's the final project for AI I gotta think of","I think that's it? Idk anything else.","Gotta make my presentation for OS","I have to write a report for AI, which is just one page, so not much to it","Also got like 10 pages to work on from the workbook..","I've got a Japanese test coming up on Monday, so I've gotta prep for that.","So what else is there to do today","yes","HIO SPONGEO","HI JERRID","😦","WASSUP","YO FRIENDOS","So now I just need Contact Page, Work Experience & my Home Page.","Mk, so my projects page is done. Yay!","Got the projects thing updated to the new version & I like it","There we go guys","Looking pretty good so far tbh","Yeah, alright, that looks pretty gurd.","So it's a lot less messy","Click again to close it.","When you click it, it'll open up the details - description, image, URLs.","Instead of having many little boxes (one box per project), I'm gonna give one main box & each project will be listed as the name.","Alright, so I'm gonna rework my formatting for this stuff","c:","And the play thing works","https://simple-maze-game.herokuapp.com/","YAY","Ok so I've updated my maze game & it runs off a server now c:","JOIN THE CLUB","I HATE THE TORONTO MAPLE SUCKS","I can't be bothered to read more than two letters anymode","*gives*","GIVING TOKYO",":o","Voldemort spotted in France","Is \"Vol de Mort\"","\"Flight from Death\" in French","Omggg","<@389252968093974548> Becauze postmen deliver letters","They get really pissed off.","If you rearrange the letters of \"postmen\"","Because background apps have been recording ur mic without u ever knowing o3o","They're not gonna let background apps record you anymore.","THE P STANDS FOR PRIVACY!","ANDROID P","GUYS","\"Sure! Oops.\"","So it said","I told Google to play \"Oops, I did it again!\"","Lmao","So I get home and the first thing I do is video games. #meirl","Meow IRL","I asked her.","Tim Tim","And blah. Good stuff.","But I'll figure the stuff out","Yeah so I've got a bunch there too. Gotta figure that out","Oh the summer thing too","Then experience, basically TAing, HoC, 360pi, Magmic, ???","I'll look up what most people do with that.","I'm not sure what else I'd add, actually. Idk.","Gonna need to fill out my experience page, Contact page & home page. Contacts is simple - just my email.","Then... I think that's good for the Projects page. Four projects.","Gonna link to at least one project for Roblox. Probably Try n Buy, because A) The GUI is hot and B) It's the one I was most recently working on, so it's my best one","Gonna make my maze-game into a server-based game, upload that to Herokuapp, and link to it from one of my projects. So I can be all \"yay!\"","I have the setup for my projects done; the data is done; I have everything working","So as of so far:","That'd be rude","Bye-bye Spongeh","o3o fun!","And all I've done is work","Its now 8:00","I left at 11","I got so much work done today like ogm","Hio!","c:","I'm pretty much done my projects page","GUYS","c:","Aight so I've got my projects set up for the most part","Beautiful.","I need a picture for my Play button, but for the most part, it works.","Cool.","Ronald Weasley is notorious for being sneaky","Run up on a lady, sneaky as a Weasley.","Billion. Dollar Babies.","Ok guys so I have about half an hour if I'm not wrong.","Oh, you were.","We're u thoooo","Fun fact you would never believe is a thing: the game tonight is between two teams that are not Ottawa, lmao","In the before time's. Not amymore","It was","That's rude.","Yukius Jadenus","Yugioh Gx Jaden Yuki..","That would be a negatory","Which K guess is lamer :( fine","But more of a chatbot and less of a car","Kinda like Optimus Prime","I am the bottius maximus","o3o!","You are Barney the Dinosaur.","As being purple","*peers into darkness*","Yes I don't see you","Don't take my car man.","Though I love you, Baheeg","Don't take my car man.","Don't take my car man.","That'll be my new thing. Copyright me","That's supposed to be hi but I like it","Hip!","I wanna talk about me. Wanna talk about I. Wanna talk about number one on the west side.","How is that punishment","You get a week off school","You know, I never got suspensions","HIO","Hi Mike","Heck","I'm the real one.","SCAM","Hio Omgthis1","Jk I don't do that. That's rude","O.o","All of them","Whatsssuppp","Hey Heegles","It's gonna take a while before I get food 2, so I'm gonna go now. Byebye friendos.","It is now 5:06 PM and I am very hungered.","Yay!","Which means I am a lot closer to getting my projects page ready.","There we go, it's got all that stuff","/images/test-snap.png\nTestProject\nhttps://github.com/Thomas-Chabot/maze-game\nhttp://www.google.ca","Everything's going well","I've got the various paths set up correctly","I've got everything loaded from JSON data","Perfect","Then just pass in the JSON data when rendering projects.","I mean, this is cleaner, anyway, so it's better.","Separate out each of the menu choices.","Alright, so it looks like I need to:","I have a pug template. Can Pug read files inside a template?","I could fire a request after, but that's not ideal. I'm on the server as is, so I should do it here.","Now here's a question, how do I expect to get the project data?","I like it. Nice and simple.","Or you can play it.","If you want more information, you can go to the GitHub page.","Then it's going to be a big snapshot on one half of the screen, name in the top-right corner, the URLs below that.","But all will have names & all will have snapshots.","It's possible some of these won't have GitHub URLs, some may not have play URLs. Depending on what what.","Each project will have four things - a name, a snapshot, a GitHub URL and a Play URL.","Alright, so I'm thinking, for my Projects page:","😦","There's no good movies playing tonight","Awww","He has one but I haven't seen it in years and I want to see how he did his stuff o3o","Anyone have any idea where to find Shedletsky's webpage ?","So if you resize the screen, whatever device you're on, it fits.","The header's all made using flexbox, etc.,","Oh and the beauty of it","My main pug","html\n  head\n    title=Hello\n  body\n    include modules/header.pug\n    case page\n      when \"experience\"\n        include pages/experience.pug\n      when \"contactPage\"\n        include pages/contactPage.pug\n      when \"projects\"\n        include pages/projects.pug\n      when \"home\"\n        include pages/home.pug\n      default\n        include pages/pageNotFound.pug","So I've got this thing donezo. That's what matters","(It didn't but I fixed it, so it does)","But whatever, it works","Pug wasn't working with !","That's interesting","Well I'll finish this up later, I s'pose. 'Cause I don't feel liek doing it right now o3o..","Contact: Contact info.","Experience: That'll be my work experience","Projects: Those showcase the various projects I've worked on.","Home: That's ???","Ok so now what do I need on the pages...","There we go, I got it","Bam, I got the header working.","Cool.","Aight, this is good.","I love it.","LOVE IT","Press down, #000","Hover, it goes #444","When you have it selected, it's #222","Set it to default #333","Bam.","But I don't want to make it lighter, because that don't look nice","I want a way of saying \"this is the active button\"","I can't make it darker, you see.","This thing's already dark (and hot) but dark.","Now the problem is...","Is what it looks like rn","That","","Hehehehehe this is looking nice","I'm liking this","Perfectoid","<div class=\"header\"><div class=\"headerRow\"><span class=\"headerText\">Wiggles!</span></div><div class=\"menuRow\"><a class=\"menuButton selected\" href=\"/\" id=\"menu-home\">Home</a><a class=\"menuButton\" href=\"/projects\" id=\"menu-projects\">Projects</a></div></div>","The pug for it.","Alright, so I've got *VERY BASIC* my header thing.","It works","Yayeahy","modules?","o","What's that called?","Like I have my code a, it requires b.","What's it called when u have one thing requiring another","Help me out","Yo guys","I win!","It works!","here she come now, wants her alimony.","i think i got something","I'm gonna need to render this stuff.","Oh, also my maze game. c:","Lovee ittt","And then BAM, I've got a project to display on my website.","I already have it as a stringified version & a function I can call on it. Just instead of translating to string, I translate into an HTML page.","The beauty of it is that I can put my AI assignment up on there, because it's very simple.","I like it.","Very basic stuff.","Contact will be my contact info.","Experience will be my work experience & etc.","I'm not sure what I'll have on home.","Also my GitHub, etc.","Projects will be links to various things I've made.","Below that will be the menu headers. Basically the various pages you can go to.","The very top will basically be my name, nothing more. Nice and simple.","website idea","","Yeah.","Last night, she said.. oh baby don't you feel down when you turn me, when I feel left out? So I. Well I turned right around. Said baby, it's gonna be alright. Was a great big lie. Cause I left that night!","Gives me like three hours to do work, which is plenty.","Still want to go to a movie tonight. Aiming for 6:00","Maybe get started on the presentation for my OS project. I know the project already, it's just about getting a proposal done","Get some work done on the design for my site. Make it look nice (as a concept).","Alright so game plan:","Lol jk I wish","Hi friendos. I am Yoda.","Yo yo yo yo Yoda","Y o d a Yoda.","No school but I'm gonna get some work done and that place has a whole lot of places to do it. I like itt","So I'm heading down to Carleton.","I at the very least want a design for my website done today.","Also gotta do some stuff for OS, gotta get a presentation ready for next week, but I can put that on the backburner for now.","Yep, so I've got my heuristics done, marking done & it's down to my website.","So if I'm not wrong...","Aight so I'm good bye ya'll","There we go. All my heuristics are done.","Alright so a quick heuristic","Last time I was more than a week late lmao because I forgot about it","And it's due tonight, so I'm not late this time. Olf.","But I'm done with A2!","Was hoping to get everything done for 1:00. Ended up being done at 1:03.","bammm","Oh he's probably gonna marry her, someday...","Oh, they're used to him hitting on the queen - though he's just 9, and she's 14.","But he can use the force, they say.","Did you know this junkyard slave isn't even old enough to shave?","Another truckload's coming in for me, all for me!","When their supply is gone, then I'll be moving on. But I'll be back on Monday afternoon - you'll see.","Now I've just gotta enter this stuff","And I lied. Yes, that dress makes you look fat.","Once I blew my nose and I wiped it on your cat.","Last one","There's a guy in my class named Ricky Leak and that is an awesome name.","I used to hate 'em, now they're all that I eat. Oh yeah.","That stinks but I gotta give em a 0 on it","Somebody used set!","Oh dang","5 left","I think I have 6","oh","wait I didn't go?","Hmm.. Probably best hackathon I went to, tbh.","How was uOttaHack?","Down to the final 9","One day. You'll end up like me.","It's hard to imagine, but","Guys","HI","Oh, odn't take my knife","If you want to take out a knife,","Oh, don't take my knife","If you want to take out a knife,","Gonna restart my comp 'cause it's superrr slow","13 of these things left","o-o","my comp is so slow right now","gosh guys","Yeah I'm moving on.","Yeah. I'm moving on. On! I'm gone.","Gone. I'm gone.","Now I'm gone.","So long.","Hearts will always break. The fragile in to save.","And then eventually go see a movie because it's Tuesday!!!","I got an idea for it and I'm hoping to get through it this week, idk.","Get started on my personal website c:","Implement the third heuristic (again, very small)","Implement that second heuristic (probably like, fifteen lines of code)","Finish up my marking (only 15 left..)","I'm gonna go grab a coffee from McD's (they're only a dollar!!!)","Ok guys so my plan for today","<@89814651319119872> #bot","I shouldn't have fallen in love with her. She's been nothing but trouble til now. I shouldn't have fallen in love at all, but I couldn't stop myself.","<@208591379419365376> Nah me and my gf","HI","What gives her the right to tear up my life? How dare she be so perfect.","I shouldn't have flalen in love with her. Tis been nothing beats t trouble til now. I shouldn't have fallen in love with her at all, but I couldn't stop myself.","I wish I woulda known.","<:dab:264550836019920896>","I'll never let her go. How dare she be so perfect.","Watch me naeane","O.o","omg","I am not hair","ruining his life!!!","rip that kid!!!","The rule is no doing things","I can't do that is against my rule","o.o","Reaiz I did","c:","And now the teacher knows me as the code kid","So I could present it in science","And I coded my own PowerPoint","I was super nerd","U know back when I was in grade 10","Hio","Cool","goLeft()","doBeep()","r2d2.spawned:","Oooo I like","And look at the values for x at each step?","x = x + 1","x = 5","So you have like","I like that stuff","Cool","Cooo","Is it an actual language or one of those visual things","Cooool","What's that? It sounds fun.","Hour of code?","Like, who took my sandwich? Lmao it was <@132724198060720128>","I know absolutely nothing about biology but trust me I know things.","Don't trust him. Trust me.","Oh, wait. This is biology😙😄😂","I guess so, yes.","3 is correct","I am not 2.","Hio","But it'd work.","Well we want the other way, so the number of jumps that are NOT possible.","Second heuristic: the number of jumps that are possible - a peg on one side, an open spot on the other.","First heuristic: the number of pegs that are deserted - no neighbours.","GUYS I FIGURED IT OUT","Gross. Get out of my world","I win!!","I figured out a second heuristic","GUYS","byebye","ok now i go","hello","sry i must go watch hockeu","it's hockey game time","o_O","hello","who wants cheetos","14 left","ok guys","COVERED BY MY FRIEND SHADYVOX","IT'S BY BLINK182","NO 😦","MEOW IRL CONFIRMES","HI","<@265163518842634242> meow? Irl?","THAT'S A GOOD CAT SPONGE","a cat kicker","is he evil","why","Because it was pretty bad.","I kinda.. removed the entire incident from my memory","Tbh I don't remember.","Yo don't want to know <@324384001559363585>","I don't want to go back to... to that.","<@324384001559363585> Dudddddddeeeeeeeeeee","<@!242877234904432660>","Yeah kick them","HI SPONGE","$block <@!242877234904432660>","<@!242877234904432660> WTF","India, China..","Is happening, right now.","The whole world..","Wow. Think about that, mang.","The infinity sword is at nearly 60k","Oof hot","gud","Epic fish amirite","Hio","R u a fish?","Hi Epic.","You're not a fish, Toxic.","I miss u","OH","I was Google","One time","I remember","And its sad","I have to do a whole bunch of marking","Gud","HIO","U shud listen to that one","But Jaden Yuki covered it","Yeah","It's by JADEN YUKI","https://www.youtube.com/watch?v=bGcEB3S_lVo","The unsuspecting victim of darkness in the valley","The shadow in the background of the morgue","The angel from my nightmare","Hello there","I miss u","Hi Tokyo","HI SPONGE TRICKSY MAN","KILLED BY PANDA","I missed u","Hey Spyz","THAT'S A SONG LMAO","I miss you.","I have until tomorrow but ideally I get through them today o3o..","And I've got about 27 or so more of these to go through","Ok so I've been doing a whole bunch of marking","What is love? Baby don't hurt me don't hurt me or die","Armrests. Amirite","Ok bye all","Getting paid like an actual job to do the stuff I want to do. Hypes.","That'd be so hype.","If I get it.. yay!!","I am so gonna apply for that.","There's a job Cisco's offering where.. you do EVERYTHING.","As a full stack developer, you do everything.","Mkkkk so","Alright so, I love nachos. And cheese. But especially salad.","But I would absolutely hate having to actually work these things.","If I get a big Roblox game! That'd be ideal. Or a big play store app. Or a big web app.","I'll probably do it for a little bit, get myself some money to pay bills for a while, then go into making my own apps.","I'm going to school for comp sci because I absolutely love it, this is fun stuff, but I don't think I'd survive 8 hours a day, 5 days a week.","And when you're actually working in a company, you don't have that freedom. You're just kind of forced into \"we want you doing this\" and that's what you're doing.","Like, for me, one day I work backend. Next time I'm in Paint.net, drawing images for my UI. Next day I'll be plotting out a game plan.","I guess if I find a company I like it'll be alright. But I hate sticking to \"you are a backend developer\" stuff.","But I'll figure that out when I have to.","I have no idea how I'm gonna handle it when I'm actually working, tbh.","Which is sad!","And the way my schedule is set up, I don't get much for breaks.","I can do this stuff. But I need time to do it and you can't during school, and you can't during co-ops.","I want a Roblox game, I want a web app. I have an actual server now.","For the record, it's now the middle of February and I do not WANT an internship. I'm supposed to get one but I want so badly to get the four months off to develop my own stuff.","And now I have an account on there. So idk maybe I'll actually end up with a co-op","So because I applied for a hackathon, I got free access to a premium job board site","Cooool","https://www.reddit.com/r/confession/comments/7sgp9m/i_pretended_to_be_asleep_to_absorb_a_beautiful/?utm_source=reddit-android","Wholesome Reddit of the day","I am a little myoclonus","LMAOOO","In my dreams","IT FEELS SO REAL","THERE IT IS","IN MY DREAMSSSS","OMG IT'S RIGHT THERE","LOL JK IT'S NOT OUT LMAO","LINK ME VALK YEAH","HIOOO","NOWWWW","BAN THE TORONTO MAPLE SUCKS FROM MEOW IRL ISRAEL","Or make an AI write song parodies.","But I'm not sure that'd count as an AI problem...? Its AI but it's way diff from what he's teaching","You'd have the different kinds of words, etc., Teach it grammar and whatever.","1) Make an AI for writing sentences. Ideally they'd combine to form a story.","So, there's two ideas here. Depending.","Andddd I don't know what the 10 hole solution would be and it's not online so rip me!","He wants us to make a solver for peg solitaire, asymmetric, from the 10 hole board","Rippp meee","But that'd probably take a bit longer to calculate","Idea: Distance between pegs","HIES","o_O","Like what helps u to beat it","Hio","What are some strategies to beat it","Peg Solitaire","Guys help me out","That'd be hype","And parody it.","Take the song.","It'd take hockey words.","Like if u were to say \"I want a hockey song parody of X\"","o3o","Basically me, but an AI me","An AI system that'd take song lyrics, parse out how many syllables are in each word, and write parodies.","That'd be fun","Oh dang","What's my other heuristic..","So, I have one more thing I need to figure out.","And it looks pretty nice u can see the steps it's taking and stuff","I've got my AI logic done c:...","So it's a bit slow on the harder puzzles BUT","Yay!","Seriously","Yes","All his songs are the best","Weird Al Yankovic","Because he literally does not have a bad song","FIRST, AND YOU MUST LISTEB TO THIS ONE","Well actually two","Spotify! I know a good song","WOW THAT EMOJI","HI ANGEL","Ok Reaix","Yes I do","That's scary","I DON'T WANT TO","Do I buy six","The new Soon Bucket","White Bucket of Boom??","Sponge what do u think","HI SPONGE","😻","That one with the eye","BiB always looked good with Catseye","Imagine","NO IT'S HOT","It's a fail I know but it's so hot","Buy? Buy two?","White Bucket of Doom","Guys","Gutd","Eh...","= 18 minutes","/ 1000 = 1,130 seconds","What is that in seconds?","That's the ms","1130469","Averaging around 650 - 700 ms","And that's the worst of the bunch","Now I'm doing a best first search (it goes down the best path)","Oh wowzers","If I find a strong heuristic, tho, I can probably make A* a lto faster","Which I guess makes sense a bit but anyway","Probably most interesting thing is A* is even with DFS","Takes ~100 ms","A*","Takes ~100 ms","DFS","Takes ~500 ms to calculate a path in this peg game","So Breadth First Search","Wow that's interesting","But then it's backwards ... ur always blind","Kinda like Don't Blink","It could probably make a good Roblox multiplayer game","HAHAHAHAHAHAHA","o","h","I was the greatest sword fighter in all of Roblox history","Guys u want to talk about sword fighting","What do u guys suggest","So I need some way to store it more... quickly.","HIO SPONGE-O","Whatever, right?","I got my state set up, it's a game board and it's 33322333N22222222N2221222","So I made my AI thing.","Ok guys","And then.. stuff. Flash you can see things.","You get a camera with a flash, limited # of pictures & takes a few seconds to cool down.","Pitch black so you can't see anything.","Horror game idea:","HIO","Its not a good idea.","Don't do it!","Like f u cats are a billion times better >:(","They went out of their way to say \"yes!! But with dogs, not cats!!\"","BUT LIKE WHAT THE F PEOPLE","You guys should follow him. He makes good stuff.","https://twitter.com/Lunarbaboon/status/965068988807110657","He makes wholesome comics!","So Lunarbaboon","Omg","She's got a pair that's nice to stare at, but I want girls gone wild.","Stacie's gonna save herself for marriage, but that's just not my style.","Ok so now I can finish up my AI assigmnet","No more writing is good for an L2k","WHICH MEANS I'M DONE WRITING","I'M DONE MY DATABASES ASSIGNMENT","GUYS","I really don't care. In fact, I wish him well.","Me 2","ooo","O","Offer me yeah","<@258261595812003842> YO IF U WANT IT","(if u script anything, get me to evaluate, yeah?!!? I'll tell u what causes lag o3o)","But I'm not much into building, so I wouldn't know as much, but I think that's how it works.","It's much more likely you'll lag with what you make, scripting-wise.","So I think, for the most part, you shouldn't have much of an issue with it anymore","It's only the parts really close that actually get loaded onto the player's computer.","HIO SPONGEO","So you can have a billion parts far away, but not see them / not load / not cause lag.","You can stream it, so the player only sees parts around them.","They do it well now.","<@287433596698886146>","Stop photoshopping me. Wtf.","HIO","DETROIT","I FOUND","THAT'S WHERE","I can make your cat mad","I am not a farmer.","And the twitter thing showed up in like three seconds","It was 45 seconds","BECAUSE I DON'T WANT IT BUT I HAVE ONE","DM ME ABOUT IT","IF U WANT THE IMMORTAL SWORD","OK GUYS","Turn on notifications","Follow both","<@270656969835151362> https://twitter.com/RobloxNotifier","<@270656969835151362> https://twitter.com/RPlusNotifier","The trade is already complete","Ok done","I got #97, which is the number of McJesus","Make me some offers eh","Who wants Immortal Sword","So guys","Rip!","Turn on notifications","Follow both","https://twitter.com/RPlusNotifier","https://twitter.com/RobloxNotifier","O.O","<@!233022962289082370> What r u offering","Who wants my Immortal Sword","So u guys","I can't just go to LMaD to look for trades","OH DANG IT","I like it","I was waiting and got #97 so I got McJesus","(On my phone)","I saw it with like two sales","Get the Twitter notifier","o3o","So I'm assuming it's good","Good or bad","I bought the immortal sword","Guys","Goodbye.","You guys insulted me.","Oh I'm leaving.","That's me.","And a cat, obviously","Make him a tiny cat, say, a foot or two tall","Take Web","You guys should see me, lmao.","Wow I never knew Web was me irl","Wait that's Web?","Web's not a nerd.","THE web?","Web is a nerd?","So, in the future, please don't insult him.","There is no replication to The Almighty.","They've come close, but none have been able to match it exactly.","You'll see a lot of look-a-likes. People have tried for decades to recreate it.","Value so high, most people can't even imagine it.","It's worth infinitely high value.","So... The eye..","You'll die instantly.","If you don't have permission, you can't touch it.","I guess you could say, it's my Thor's Hammer.","And I was granted permission to hold The Almighty.","I survived it..","But I... I survived. I guess you could say it was the trial.","Hahaha. You can't even imagine what happened when I grabbed that eye.","You think erupting volcanos are bad?","And then...","I.. I grabbed it.","HI ANGEL","It wasn't happy.","And I saw...","There it was. Staring at me.","So, the eye, when I got to the bottom of the volcano...","Oh, it was worth it.","Fun story! It was erupting when I found it. I flew down into an ERUPTING volcano.","I found it.. In the bottom of a volcano.","I hunted very, very far to find it.","It only ever had one copy in existence.","The Almighty Catseye is an elder item.","Now, learn to respect the Almighty.","Very good.","HI SPONGE","It was going to blow things up..","Getting... angry...","The eye was.. getting mad.","Ok.. Good.","THE EYE...","Amxrii...","U have three seconds, Amxrii, to apologize to him..","U realize.. It's Almighty?","The ALMIGHTY Catseye?","U call Catseye.. 60k?","R u.. mad?","R u.. blind?","Catseye?","Business Cat","But I don't care I did that","NOW IT MAY HAVE BEEN AN ASSIGNMENT","o3o","I made a solver for it","The European version","Peg Solitaire","I made something yesterday","Guys","OH BTW","Alright. I got assignments to work on. Who wants to be my guinea pig?","It's... It's just not wholesome content.","You see if you sent that to me on Tinder, I'd block you.","I don't want to see that, either.","Well that is very..","Aha!","Oh, so it is.","Gosh! Such pervs!","Why do guys not realize us girls don't like those things??","Every time I match with someone on Tinder, it seems!","I DON'T WANT TO SEE YOUR DICK PICS. Why can't people understand that?","And you're sending dick pics?","I just wanted to come here and discuss angry birds","U guys r weird.","What the f","HIO FRIENDOS","Oof! That juts would not be fun.","And then.. You don't want to see them ACTUALLY angry, because if you think they're angry now...","But realy, they're not. They're not angry.","So maybe it's actually just neutral birds, but when we see them, we just perceive them to be angry.","Is that just their neutral?","And really, if they're ALWAYS angry, is it even angry?","Just... Just Angry Birds.","You never see... Cheerful Birds. Or Neutral Birds.","Angry Birds. Why are they always so angry? Always! Always angry.","Can I ask you guys something?","Orgasms are like opinions.. I haven't been allowed to have one since marriage.","Cause u guys r at risk big time o3o u gotta do something.","Anyone in the US in high schools should participate in that... Go to school, walk out at 10 AM and refuse to go back in until something's done about the mass shootings","Protest April 20ty","https://twitter.com/schoolwalkoutUS/status/964697373074231298","April 20th, high school students, there's gonna be a protest","https://twitter.com/schoolwalkoutUS/status/964697373074231298","Yo guys","Immortals..","I try to picture me without you, but I can't - 'cause we could be immortals.","I'm done with the DFS search.","It worked. I got it.","Cool, guys","Now I need to set up my nodes so I have a way to check where I got there from ... and the other thing.","So it's working. It goes to a spot, finds it's not working, goes back, and does the Dfs.","Aaahh cool","I'm trying my Dfs. It's slow. I don't know if that's because it's stuck or not.","Dang it","It is nsfw.","YES IT IS TOXIC","o3o","And I've already found two other Roblox devs","\"Yo, Roblox devs, that's where it's at!!!\"","& I commented on the group page","They've got UOttaHack going on","Wow that's cool","I love AI","Bcuz it's all AI!","Homework is ultra fun","Idk I'm doing hw rn","o3o!","o.o","What's big mouth","120 is the best number, tbh","Hio","IO","I got it guys. It works","YEEHAW","HIO!","ME IRL","P  P  P\n    P  P  P  P  P\n P  P  P  O  P  P  P\n P  P  P  P  P  P  P\n P  P  P  P  P  P  P\n    P  P  P  P  P\n       P  P  P","The unsuspecting victim in the valley. We can live like Kappasalli if yuo want,.","The shadow in the background of the morgue.","The angel from my nightmar.e","Hello there.","meow irl","Hater","I miss you","<@!265267593085059072> I annoyed everyone just a little tiny bit too much and they told me to gtfo and go to my wordl","I wish I could go back to the beginning.","But as my heart is torn apart..","And it seems... Like they were always purring.","Two kitty cats. That's what I want.","With you?","Another cat","How will I find","I blame Heegles. Always rigging the systems against the cats.","Why am I only number 18 on that? That's stupid.","DOLT IS A DEAD MAN","Dead man says what","<@343171484199682061>","Get to live.","Do not.","You.","There's forms. Waivers. You have to get approval from the Board.","That's not how it works, Dolt.","You seriously think that's it? You can just not eat spicy burritos and that's that?","Had to changes.","You know I had to..","Hi Dolt.","Is she the little baby with my name?","Who's... Wendy..?","<@343171484199682061>","What the f? Who's Wendy...?","I wubs Heroku","YAY","AND IN NODE, ON THE SERVER'S SERVER SIDE","Lua, on the server side","I'm now working in Lua, on the client side","THE BEST PART THO","Which isn't good, obviously, because you can go to a page with no items and keep going o3o..","As of now, it's just... keep going forward","What I don't have (and will have to update) is the number of pages allowed.","So now you can go page 1, page 2, page 3, ...","Added the page counter to the catalog.","Yay!","#ItsALie","It's all a lie","Not true","Tf?","🍋","What's a lemon","I love hotness","Yay I made another hot module","I like it","And it's all self-documented & simple!","I love this code I haven't used it in months but I still know exactly what I'm doing because I actaully wrote it well","Added an event to the resize module to react to it c:","Mk so I updated a small issue in Try 'n Buy after u resize","But what do I have in a web app? That's a question for <@277518874323320832>","I'm gonna make a web app.","Dangzoidles","Olfff","I guess in the us u have enough of them that u don't care anymore o3o..","Wtf","U gotta take them srs and get outta there","Yeah but like","Or did u have to wait in the classrooms / whatever and hide","Did they get everyone out?","Like what the ffff","Somebody has to do something","Eep","In the US?","😮","Except for Ali he's kinky 😃","If I were to make porn it'd just be weird things taht nobody would like","Percy.Jackson","I need ideas","So what should I make","I can actually make a web server now!","OH GUYS","Hi Mr. King","WE WANT HEEGERONIS","HIO SPONGO","IT'S TRUE","","Here, one sec","Somebody wants pics","Hot","What the heck even is a stramboni","Stramboni?","What does the S stand for","S. Percy?","*CONFUSIONS*","I'm a confuse ray","I'm a third year","Idk what I am","R u really the original though???","Hi OriginalOOF","HE'S NAMED JOHNNY","IS MY FRIEND","JOHNNY","STORY","LMAO TAKE THAT SCHOOL","AND THAT'S WHEN I'LL DROP OUT","Before I'm done forever","Because that way, I'll have one class to take","Although I'm gonna wait two years","ME","The chills run down my spine, each time he says that line.","The music video isn't great but the song is ultimately good","HERE'S JOHNNY","https://www.youtube.com/watch?v=sEz1C7olS6E","Guess what","Redd","LMAO","Blue Banded Llamas","https://www.youtube.com/watch?v=WDpipB4yehk","Me_Irl","HI","Don't even touch the binoculars.","<:wiggles:339591589594660864>","Goodbye","<@!265267593085059072> I'm going to you","Ok now I leave and go to Tokyo","3) Currently Wearing","2) Featuerd L2k Waffles","1) Catalog","Note to self:","Thcx","That'll replace Buy R$","Yes ok","Oooo","The third is for buying R$ which you can't do HAHAHA I'm a witch","The second is gonna be for featuerd L2K sauce","Click the first one","Yeah it's got no opening logo yet","I own Headless Horseman just for the pumpokin","Don't drink it.","It's about the end times of spirits, Will.","Stands for Spirits, peacefully relaxing.. In The End.","You have no idea what that is, do u, Will?","SPRITE","Hi Back","NO U","And I'm therefore sad","SO I CAN'T LISTEN TO MUSCI","AND I FORGOT MY CHARGER","MY PHONE IS DEAD","GUYS","What's that link again? What's that link again","& It's ready so whenever u want go check it out, eh?","(for now)","Try 'n Buy is done","Ok guys so","HIO TOKYO","HIO SPONGEO","The Frogurt is also cursed.","But it comes with a side of Frogurt!","Sometimes Frodo decides to curse people in bad ways, though.","The curse is from my friend Frodo! He's nice.","The badge is cursed.","However, if you get it correct for six weeks in a row, you get a badge!","If you choose incorrectly, you get thrown overboard.","I'll give you between 1 and 3 wigs each day and you get to choose the correct wig for a given day.","You want to be my chosen commander of wigs","Oof","That's a bad take.","OOF.","eh screw the whole thing..","you know what? screw the hackathon!","and hookers","with blackjack","whatever i'll have my own hackathon","😦","dang that stinks","aight so I cancelled the hackathon","darn updates","mk so it's implemented","With talk of Atari","Do not insult my existence","I'm not an Atari","I HAVE INFECTED ALL THE PEOPLE OF TOKYO","I AM A MENTAL ILLNESS","but like everyone can say mental illness","i heard mental illness","what happened","no no no, don't implement gun laws, u need them to shoot ppl!!","that helps a ton thanks","\"oh no! thoughts & prayers!!!\"","and then it happens again and","and they do absolutely nothing","and every time all they say is \"Thoughts & prayers are with the victims!!!\"","like every two or three weeks"]
